export let industryData = {
  "classes": [
    {
      "class": "技术",
      "posts": [
        {
          "post": "后端开发",
          "skill": ["C/C++","Java", "Python","PHP","后端算法","GIS工程师","Node.js","C#","NET","Hadoop","Delphi","VB","Perl","Ruby","Golang","Erlang","数据采集"]
        },
        {
          "post": "移动开发",
          "skill": ["HTML5", "JavaScript", "移动web前端", "iOS", "移动开发","Android","UE4","前端开发","WP","U3D","COCOS2DX","Flash开发"]
        },
        {
          "post": "测试",
          "skill": ["测试工程师","测试开发","硬件测试","软件测试","移动端测试"]
        },
        {
          "post": "运维/技术支持",
          "skill": ["运维工程师", "运维开发工程师", "网络工程师", "系统工程师", "IT技术支持","网络安全","系统管理员","系统安全","DBA"]
        },
        {
          "post": "数据",
          "skill": ["数据", "ETL工程师", "数据仓库", "数据开发", "数据挖掘","数据分析师","数据架构师"]
        },
        {
          "post": "项目管理",
          "skill": ["硬件项目经理", "项目经理", "项目主管", "项目助理", "项目专员","实施顾问","实施工程师","需求分析工程师"]
        },
        {
          "post": "硬件开发",
          "skill": ["硬件工程师", "嵌入式", "自动化", "单片机", "电路设计","驱动开发","系统集成","FPGA开发","DSP开发","ARM开发","PCB工艺","射频工程师"]
        },
        {
          "post": "通信",
          "skill": ["通信技术工程师", "通信研发工程师", "数据通信工程师", "移动通信工程师", "电信网络工程师","电信交换工程师","有线传输工程师","通信电源工程师","无线射频工程师","通信标准化工程师","通信项目专员","通信项目经理","核心网工程师","通信测试工程师","通信设备工程师","光通信工程师","光传输工程师","光网络工程师"]
        },
        {
          "post": "电子/半导体",
          "skill": ["电子工程师", "电气工程师", "FAE", "电气设计工程师"]
        },
        {
          "post": "高端技术职业",
          "skill": ["高端技术职位", "技术经理", "技术总监", "测试经理","架构师","CTO","运维总监","技术合伙人"]
        },
        {
          "post": "人工智能",
          "skill": ["智能驾驶系统工程师", "反欺诈/风控算法", "人工智能", "搜索算法","自然语言处理","推荐算法","算法工程师","机器学习","深度学习","语音识别","图像识别","算法研究员"]
        },
        {
          "post": "销售技术支持",
          "skill": ["销售技术支持", "售前工程师", "售后工程师"]
        },
        {
          "post": "其他技术职位",
          "skill": ["其他技术职位"]
        }
      ]
    },
    {
      "class": "运营", // xl
      "posts": [
        {
          "post": "运营",
          "skill": ["产品运营","内容运营","数据运营","游戏运营","运营"]
        },
        {
          "post": "高端产品职位",
          "skill": ["产品经理","运营策划"]
        }
      ]
    },
    {
      "class": "市场", // xl
      "posts": [
        {
          "post": "市场",
          "skill": ["市场营销","销售","市场","媒介策划","公关"]
        }
      ]
    },
    {
      "class": "人事", // xl
      "posts": [
        {
          "post": "人力资源",
          "skill": ["人力资源","人力资源专员","柜面服务","人力资源经理","人力资源主管"]
        },
        {
          "post": "行政",
          "skill": ["行政管理","管理培训生"]
        },
        {
          "post": "财务",
          "skill": ["审计","风险管理"]
        },
        {
          "post": "法务",
          "skill": ["法务"]
        },
      ]
    },
    {
      "class": "高管",
      "posts": [
        {
          "post": "高级管理职位",
          "skill": ["高级管理职位"]
        }
      ]
    },
    {
      "class": "教育培训",
      "posts": [
        {
          "post": "教师",
          "skill": ["英语教师"]
        }
      ]
    },
    {
      "class": "医疗健康",
      "posts": [
        {
          "post": "护士/护理",
          "skill": ["护士长", "护士", "导医"]
        }
      ]
    },
    {
      "class": "金融",
      "posts": [
        {
          "post": "税务审计",
          "skill": ["会计"]
        },
        {
          "post": "银行",
          "skill": ["银行"]
        }
      ]
    },
    {
      "class": "销售",
      "posts": [
        {
          "post": "销售",
          "skill": ["销售"]
        }
      ]
    },
    {
      "class": "通用",
      "posts": [
        {
          "post": "通用",
          "skill": ["通用"]
        }
      ]
    },
    {
      "class": "外企",
      "posts": [
        {
          "post": "外企",
          "skill": ["外企"]
        }
      ]
    },
  ]
}