export let detailBanks = [
  
    { // 第1套面试题
      "industry": "运营", // 行业
      "count": 10, // 题目数量
      "title": "运营面试精选题（三）", // 题库标题
      "tip": "", // 题库提示
      "questions": [ // 问题序列
        { // 第一道题
          "title": "请用一分钟的时间介绍一下自己", 
          "refer_answer": "自我介绍的注意事项：\n1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //2
          "title": "请说一下以下几个名词代表的意思：广告展示，广告点击，广告转化率。", // 问题的标题
          "refer_answer": "广告展示：该广告在设定时间范围内的展示数量，也可以理解为曝光，广告在页面上曝光显示的次数，显示一次记为一个pv，被一个用户看到记为一个uv。\n广告点击：该广告在设定时间范围内的点击数量，广告被点击一次记为一个pv，被一个用户点击记为一个uv。\n广告转化率：=广告点击/广告展示*100%。具体去pv还是uv做除法，看实际应用时的衡量维度。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //3
          "title": "说一下你自己做过的最有成就感的一件事是什么？怎么做的呢？", // 问题的标题
          "refer_answer": "(这个题目结合具体实际经验作答即可。)\n参与了一个项目，而且是从0到1的项目，之前从来没有做过，而且对结果也没有太大的预期，但是通过自己的努力，最终的结果远远超出的预期，这个让自己很有成就感。\n具体是一个活动的宣传，由系统框架到具体每一步，从拉新，到转化报名，每一步都有去在有限的资源内克服种种困难去达到了预期，这里不做特别详细的描述，总之回答一个和应聘岗位相关的有成就感的经历即可，能体现出来自己的专业能力和一些加分项的，太无关和边缘的就不要提了.", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //4
          "title": "说一说你做过的最有趣的一件事。", // 问题的标题
          "refer_answer": "这个题非常发散，主要是从不同的角度去了解你这个人，回答的不减分就可以，能加分就更好了，最好是和岗位相关的一些事情，以及能体现出自己的一些能力。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //5
          "title": "说一说你有没有相关的实习经历，主要做了哪些工作，都有什么收获呢？", // 问题的标题
          "refer_answer": "如实作答即可，和岗位相关的工作即可;\n主要体现的要点就是：要表现出自己做的工作都是有意义的，以及在有限的工作中如何发挥出大的价值，和及时的总结和优化，最好用数据来体现自己的一些成果。\n收获的话也是需要罗列出跟岗位相关的能力和其他方面的收获。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //6
          "title": "聊一聊你如何看待加班的呢？", // 问题的标题
          "refer_answer": "加班有两个方面：\n一方面可能自己确实工作效率太低，如果是这样，我会努力提高工作效率，减少不必要的加班；\n另一方面，可能确实这个项目确实有点急，为了公司效益会选择加班，但如果平时非特殊时间段也要求加班，需要给予加班费。（当然这块可以开玩笑是的去说）", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //7
          "title": "说一下你最近都看过什么书，或者推荐一本你认为对你影响最大的书？", // 问题的标题
          "refer_answer": "这个问题最好是回答一些比较跟岗位挂钩的书，比如：最近在看《引爆点》,这本书利用三个法则去讲述了营销，是一个可以实际应用的方法论，而且很值得思考，以后在做营销相关的时候都可以用的到，然后可以稍微介绍一下这本书的一些精华部分，最后再总结一下即可。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //8
          "title": "如果你和团队成员发生意见不一致的情况，怎么解决呢？", // 问题的标题
          "refer_answer": "1.明确对方的需求，是真的觉得这个方案不好还是说其他的原因。\n2.反思自己，明确自己的问题，如果连自己都说服不了，更不要说说服别人。\n3.保持自信。\n4.数据思维。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //9
          "title": "你觉得如果团队有人拖后腿怎么办？", // 问题的标题
          "refer_answer": "分析有成员落下进度的原因，是分工不合理还是成员态度问题导致。明确问题原因后，针对性调整，分工不合理就进行分工调整，如果是成员态度问题，则进行沟通，督促工作进度。总之分析表象下的原因，对症下药。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //10
          "title": "请以手机或笔记本电脑为例，论述一下你认为消费者最关心的三个产品属性。",
          "refer_answer": "以手机为例来说明。女性用户：外观、款式、品牌。男性用户：功能、内存、质量。",
          "note": "",
          "analyse": ""
        }
      ]
    },
    { // 第2套面试题
      "industry": "产品经理", // 行业
      "count": 10, // 题目数量
      "title": "产品类面试精选题（一）", // 题库标题
      "tip": "", // 题库提示
      "questions": [ // 问题序列
        { // 第一道题
          "title": "请用一分钟的时间介绍一下自己", 
          "refer_answer": "自我介绍的注意事项：\n1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //2
          "title": " 你来说说，运营和产品有什么区别？", // 问题的标题
          "refer_answer": "产品是实现o-1，运营是实现1-100。从某种角度上说，产品和运营是不分家的。产品想的是如何生个健康的孩子，运营想的是如何把这个孩子养的好好的，而运营最好就是在孩子刚开始的时候就介入进来，毕竟很多时候孩子在一开始就需要好好对待。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //3
          "title": "你来说一下，为什么电影类app先选座位后付款，飞机先付款后选座位？", // 问题的标题
          "refer_answer": "1安全维度:飞机根据最终付款的人数，按照空间合理安排乘客座位，保证均匀分布、飞机平衡，避免人少还扎堆一个区域，从而避免气流颠簸。而看电影则没有这方面的考虑，可以让用户先占座再付款。\n2用户需求维度:电影属于娱乐消费，主要体验是视觉效果，座位直接影响视觉效果。看电影的目的是通过电影获得优质的体验，所以用户的偏好会影响选座，而座位会影响观影体验。比如说有的用户习惯于某个位置，比如情侣喜欢远离人群的座位，比如爱上洗手间的人喜欢坐边上，比如不乐意给他人让道的喜欢坐中间……等小部分用户需求。而飞机属于交通消费，是特定场景内的刚性需求。坐飞机的根本需求是从A地到B地，座位对实现这一需求的影响不大。比如说就算座位不舒服，用户也不得不乘坐。即抓住根本需求，坐飞机并不是为体验坐飞机的感受。\n3运营成本与购买效率维度:飞机的运营成本较高，还需考虑航司的因素。有的情况是，一架飞机是两家或两家以上航空公司共用一个航次，所以必须等待期限内的所有用户付款后，才能安排座位，即飞机选座有延迟。飞机为保证大多数用户的购买效率，所以制定先付款后选座的规则，不然用户占座查看半天却不付款很影响运营。而相比之下，售卖电影票的运营成本远低于飞机票，对购票效率的要求也不高。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //4
          "title": "你来说一下，如何选择开一家便利店的地址？", // 问题的标题
          "refer_answer": "1首先了解自身实力，包括供应链能力、产品结构、产品优势点等，再由供应链实力去决策便利店的店面形式，是商圈店，还是社区店等，以及是否加盟品牌。\n2其次考虑客流量与客流的质量，分析可能的顾客的年龄阶层、收入水平及消费习惯等因素，选址的逻辑以写字楼、商圈、街区、社区、学校等人流密集的区域为主。\n3再者考虑供应商如何给自己送货，尽量避免便利店开在区域边缘，这会导致供应商的物流成本过高，以及自身的产品结构不完整。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //5
          "title": "请你来简单描述一下线上招聘，包括宣讲、答疑、笔试、面试等的优势", // 问题的标题
          "refer_answer": "1.信息量大，不受时空限制：不受场地、空间等限制，因此能方便地实现多部门、多机构之间的资源共享；\n2.信息查询搜集十分便捷：招聘网站都有完备的搜索功能，求职者可以利用此功能快速准确地查找到行业、职位、工作地点、薪水等信息；\n3.节省成本：对于求职者和招聘方来说都是节省成本的事情。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //6
          "title": "请说一下，你是如何看待区块链技术的？", // 问题的标题
          "refer_answer": "1区块链本质上不是一项新技术，而是多种网络技术组合来解决一个新问题，而这个新问题的核心是共识算法。\n2区块链完全是一种分布式数据库，采用分布式数据库的特征，但为达成强数据一致性和不可篡改，牺牲掉很多分布式数据库的优点，当然也带来一些分布式数据库没有的特性。\n3区块链技术是去中心化的，解决的是市场经济中最核心的“信任”问题，把陌生人之间的信任成本降到极低的水平。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //7
          "title": "请阐述一下，你为什么想要做产品经理？", // 问题的标题
          "refer_answer": "一、兴趣:因为自己很喜欢做产品相关的事情，也比较喜欢有逻辑性的东西，做产品能给我带来过程中的愉悦和做完的成就感.\n二、经验:因为我有产品相关的经验，我觉得自己能够胜任好这份工作\n三、性格:我觉得我的性格也比较适合做产品，喜欢钻研，喜欢挑战，还喜欢与人沟通。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //8
          "title": "谈谈你对产品经理的认识，你认为产品经理需要有哪些特质？", // 问题的标题
          "refer_answer": "学习能力 执行能力 沟通能力 抗压能力 逻辑思维等，具体的可自己展开说。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //9
          "title": "你觉着自己适合做产品工作嘛？针对你认为产品经理应具备的素质，举例自己是否符合、有哪些匹配的例子。", // 问题的标题
          "refer_answer": "我觉得自己适合做产品工作，我认为的产品经理应该具备的素质有学习能力 执行能力 沟通能力 抗压能力 逻辑思维\n学习能力：比如自学python一周就上手了\n执行能力：一般都是计划中的事情都会完成，如果有急事肯定更是不拖延\n抗压能力：平时遇到很大压力的时候或者遇到很大的事情的时候，也没有逃避，而是去积极解决问题，同时心里上的压力会通过运动来排解（具体的例子这里就不多说了）\n逻辑思维：喜欢玩狼人杀等推理游戏，很享受其中的乐趣", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //10
          "title": " 你认为产品经理的日常工作有哪些？",
          "refer_answer": "我认为产品经理的日常工作主要有调研市场、用户，挖掘需求，将用户需求转为产品功能并判断优先级，协调各方资源实现产品，验证产品效果。",
          "note": "",
          "analyse": ""
        }
      ]
    },
    { // 第3套面试题
      "industry": "产品经理", // 行业
      "count": 10, // 题目数量
      "title": "产品类面试精选题（二）", // 题库标题
      "tip": "", // 题库提示
      "questions": [ // 问题序列
        { // 第一道题
          "title": "请用一分钟的时间介绍一下自己", 
          "refer_answer": "自我介绍的注意事项：\n1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //2
          "title": "请你来简单描述一下线上招聘，包括宣讲、答疑、笔试、面试等的劣势", // 问题的标题
          "refer_answer": "1.缺少互动，信息反馈少：网上招聘会的等待期相对更长，经常是简历发出后数十天才接到反馈，有些甚至石沉大海；\n2.企业宣传力度可能不够：一些不知道该企业的学生可能会因为线下招聘而了解此公司，而线上招聘的前提条件就是学生得知道该公司，否则根本不可能去搜索公司主页并打开线上宣讲的界面的；\n3.竞争更加激烈：同样一个职位在网上发布后，人事经理收到的简历比现场招聘会要多。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //3
          "title": "请你谈谈什么是成功的产品？可以结合实例说明。", // 问题的标题
          "refer_answer": "我觉得成功的产品是能够满足用户需求，解决用户痛点，同时体验非常好的产品。比如微信：能满足用户的社交需求，同时用的也非常顺手，界面简洁，体验非常好。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //4
          "title": "请你说说产品经理和项目经理有什么区别？", // 问题的标题
          "refer_answer": "1、首先，从知识领域来说，项目经理要求技术背景，这是必须的，一般团队的项目经理由非常有项目经验的RD担当，他的职责在于将目标转化为可量化可实现的项目计划，偏重于执行层面。而产品经理的知识领域较泛，且不一定非要求懂技术。\n2、其次，从责任周期来说，项目经理职责有始有终，他可以负责完一个项目后，再无缝切换到另外一个项目，而产品经理基本不能，产品经理随着产品一同成长，产品的成长更迭伴随着无数的项目。\n3、第三、侧重点不同，项目经理关键词：项目、排期、人月；产品经理关键词：需求、用户、产品。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //5
          "title": "请阐述一下，你是如何理解用户产品经理和商业产品经理的区别的？", // 问题的标题
          "refer_answer": "用户产品经理主要是研究用户，接触用户，了解用户，开发用户需求，更好的满足用户。而商业产品经理主要是对商业模式的探索，怎样赚钱、盈利。用户的核心是围绕用户，商业是围绕产品。产品模式也有一定区别。商业产品的特点是直接切入商业本身，在产品出现的时候商业模式基本就已经确定，基本不存在裂变的可能性；用户产品的特点是通过切入用户需求来满足商业变现的可能，在产品出现的时候盈利模式并不确定，并且裂变的可能性比较大。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //6
          "title": "请说说，你平时怎么培养自己的产品感？", // 问题的标题
          "refer_answer": "1、需要对所有的事情保持一个好奇心，多去体验各种产品。\n2、多思考，思考每个产品的逻辑，包括战略层、范围层、结构层、框架层、表现层。\n3、多和其他人讨论和交流，自己多总结，形成一个自己的思考框架和模式", // 问题的参考答案。
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //7
          "title": "你来说说资讯类产品如何差异化呢？", // 问题的标题
          "refer_answer": "1根据内容特点和用户定位，资讯类产品大体可分为三类：资讯类、期刊类、图书类。这三类产品的边缘较模糊，相互之间有渗透。例如资讯类的今日头条、Zaker、天天快报，四大门户新闻客户端，也会提供期刊类内容点读。期刊类的三联、外滩画报、中国新闻周刊等客户端在新闻快讯推送上的力度也不小。而图书类的如拇指阅读、网易云阅读、起点读书等也会提供资讯类和期刊类的内容。\n2但这三类资讯类产品的差异化非常明显，重点推介的内容在深度、文风、收费模式上都有各自的优势，满足用户不同层面的需求。\n3使资讯类产品差异化主要有6种运营手法：专题策划、依靠内容非授权复制、根据用户兴趣做定制服务、内容的人工甄选、优质内容的商业二次开发、强化用户互动等。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //8
          "title": "如果你是抖音负责人，你要如何控制不良信息？", // 问题的标题
          "refer_answer": "从外部（规则、人员等管理）:1.在内部设立追责机制，进行全员普及培训，力争做到有标准必落实、有问题必重视、有违规内容必查删；2.扩增审核人员的数量，控制每日上传视频数总量，保证视频总量与审核能力相匹配；3.引入社会监督力量，直接接受全社会监督；\n从内部（产品设计本身）:1.建立未成年人保护体系，对于未成年用户，将用专门的策略限制内容展现和设置相应的社区权限，拍摄短视频需在家长指导下进行；2.对视频分级管理，过滤未成年用户可能看到的视频内容；3.建立信用体系，给每个用户建立信用档案，“网友如果总发违法违规的东西，信用积分降低到一定程度就应当进入黑名单。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //9
          "title": "请你根据谷歌眼镜来设计一款 App，描述你的设计思路。", // 问题的标题
          "refer_answer": "我设计的应用整合了面部识别系统，能够通过识别对方面部，来推测对方年龄、性别和实时曝出对方实时的情绪。当该应用整合进谷歌眼镜后，用户即可判断，坐在你对面交谈的对象到底是男性还是女性，年轻或年老，快乐或悲伤。同时该系统数据均为离线存储，不会将数据发送至云端，所以隐私困扰基本不存在。\n本应用主要功能为面向特定人却提供社交帮助，比如自闭症患者，或是很难识别他人情绪的社交障碍者。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //10
          "title": "现在需要设计一个内容社区产品，可随便选取垂直领域或者目标人群，你会怎么做呢？",
          "refer_answer": "垂类人群的话，我会选取爱好收藏的人群作为目标人群。首先说下原因：因为是内容社区，所以在这个社区里的人一定是有很多共同话题的，而且这个话题是有许多讨论空间的，看看别人的经验，学习别人的方法。而收藏有非常多的窍门，怎么鉴别，去哪收藏，分享藏品，都是非常好的内容。其次具体怎么做的话，第一一定要做好用户调研，看看这部分人群关心收藏的哪些部分，再把社区按照这个分类划分好；接着会首先引入一些PGC，因为没有专业内容的话很难吸引到用户；最后在成熟情况下，再产品和运营相配合，大力进行UGC的推广。",
          "note": "",
          "analyse": ""
        }
      ]
    },
    { // 第4套面试题
      "industry": "产品经理", // 行业
      "count": 10, // 题目数量
      "title": "产品类面试精选题（三）", // 题库标题
      "tip": "", // 题库提示
      "questions": [ // 问题序列
        { 
          "title": "请用一分钟的时间介绍一下自己", 
          "refer_answer": "自我介绍的注意事项：\n1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //2
          "title": "如果做一个韩剧或者日剧或者美剧的APP，你会如何做呢？", // 问题的标题
          "refer_answer": "我会做一个“看美剧，学英语”的APP。用户在这里可以看到各类美剧，并且可以设置字幕展示方式：只展示英文，中英文都要，不要字幕。并且，可以查看到该美剧里面出现的俗语啊等知识点，更地道地学英语。此外，还可以在社区内和同样喜欢美剧或者想学好英语的小伙伴们交流。此类APP的核心并不在美剧资源要很多很新，而在于要把平台上有的每一部美剧都前期通过编辑整理好引导好。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //3
          "title": "尝试设计一款智能产品，应用场景及功能自定。", // 问题的标题
          "refer_answer": "我会设计一款智能眼镜。现在人们经常遇到这样一种情况：看到一个词，不知道什么意思，需要另外打开一个网页，搜索一下，再在找到的一堆结果里找一找；或者说，遇到一个很难的计算，要掏出手机或者计算器，按下一堆按键。我希望智能眼镜可以解决上面的这种问题。用户戴着这种智能眼镜将目光定位到屏幕的某个位置时，就会自动唤起“求知”程序，眼镜内置的系统会自动搜索或者计算，并在眼镜上显示出正确的结果，大大提高了效率。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //4
          "title": "针对25岁至35岁的男性，设计一款内容电商产品，需要说明设计思路，产品构成，产品定位。", // 问题的标题
          "refer_answer": "25-35岁的男性正是出于事业的打拼期，这个阶段的男性往往会在工作上投入非常多的时间精力，同时面临着品质生活和美好感情的期望，但是没有足够的时间去经营。所以我们可以设计一个为25-35岁男性提供养生办公、健康娱乐、浪漫男士等服务的电商平台，通过种草的形式进行分享传播。\n定位是，优质男青年的一站式购物平台。\n产品主要分为三个板块。一是电商的展示搜索分类，和市面上的电商平台基本一致。二是基于ugc和pgc结合的内容推荐板块。三是用户的收藏订阅及订单管理。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //5
          "title": "如果为00后设计一款饮料，你会如何设计，请说明你的分析思路。", // 问题的标题
          "refer_answer": "为00后设计“带有随机广告的随机果味儿气泡水”。00后大部分处于小学到高中的阶段，相对于成年人他们的压力少，但好奇心重，贪玩。所以基于孩子处于成长又天性好玩，对新鲜事物充满好奇的阶段，为他们设计一款 带有动态广告的随机果味儿气泡水。饮料部分采用纯净水+气泡+微量果味儿；广告部分采用饮料名称（正面）+对于00后的经典影视台词（相对背面）+符合果味儿的背景色；名称采用  X味儿气泡水。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //6
          "title": "如果让你来设计一款智能音箱，你会先做哪三个功能？为什么？", // 问题的标题
          "refer_answer": "1、语音点播：歌曲、新闻、有声书、儿歌/儿童故事等,音响本质还是内容的传递者，通过智能音响传达一些我们生活中比较需要的、有场景有价值的一些内容\n2、生活助手：天气、快捷查询、电费、购物、日程提醒、闹钟等,既然是智能音箱，链接互联网之后当然要和我们的其他生活数据结合起来，通过音响这个新颖的IO方式进行操控\n3、家电控制：用以控制灯光、电视、空调、饮水机等,当下智能生活已经越来越普及化越来越广泛化，多种智能硬件已经走进了人们的生活，智能音响可以作为控制家庭智能生态的终端和IO方式", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //7
          "title": " 在微信文章中，如果屏幕上只露出一半二维码，长按图片是没有「识别图中二维码」这个选项的。你认为这是为什么？", // 问题的标题
          "refer_answer": "微信识别二维码的原理是长按的时候相当于将当前手机屏幕截屏，识别截屏后的图片。因此，只露出一半二维码，截屏后的图片中二维码不完整，也识别不到，故没有该选项。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //8
          "title": "目前在互联网领域，人工智能无疑是当下的热点之一。请任选一款你熟悉的人工智能领域产品，列举它的目标用户、核心功能和商业模式。", // 问题的标题
          "refer_answer": "小爱音箱（小爱同学），个人感觉人工智能技术目前还是要落地到硬件产品上。目标用户：渴望通过技术提高生活效率和生活体验的年轻用户，追求科技感时尚感。（虽然会给小孩子或者老人使用，但购买人群还是年轻用户）\n核心功能：语音识别、语音合成、语义理解（多轮语音对话）\n商业模式：智能家具为行业切入点，抢占流量入口，进行流量的商业变现；通过构建完整的智能家具闭环，硬件的销售收益；硬件覆盖度的提高，为其软件生态的构建打下坚实基础（毕竟苹果还是靠appstore赚钱的）", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //9
          "title": "请你简要描述一下，产品经理如何进行竞品分析？", // 问题的标题
          "refer_answer": "1、先下载相关竞品进行相关功能的体验\n2、搜集各产品的数据（日活、月活、留存率等），查看各产品的版本迭代路径\n3、明晰各产品的产品定位、目标用户画像、核心功能模块、商业模式等\n4、选择产品中较为核心的几个功能，进行着重的体验对比\n5、根据第2、3点的内容，分析各产品再核心功能上产生差异的原因，以及带来了哪些收益,给出当前产品问题的解决方案", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //10
          "title": "请详细分析一下抖音和微视的区别。",
          "refer_answer": "抖音：中心化。以音乐创意视频起家，围绕核心优质原创内容生产者，持续规模化的生产输出有创意的短视频。\n微视：从引入明星网红，借助粉丝效应产生差异化，吸引用户。",
          "note": "",
          "analyse": ""
        }
      ]
    },
    { // 第5套面试题
      "industry": "产品经理", // 行业
      "count": 10, // 题目数量
      "title": "产品类面试精选题（四）", // 题库标题
      "tip": "", // 题库提示
      "questions": [ // 问题序列
        { //1
          "title": "请用一分钟的时间介绍一下自己", 
          "refer_answer": "自我介绍的注意事项：\n1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //2
          "title": "你认为快手和抖音的盈利方式有什么不同？", // 问题的标题
          "refer_answer": "快手：去中心化，由素人内容生产者为中心自发生产内容。除了流量变现中的广告和电商分成，直播打赏分成、直播间贵族（会员充值）开通提成等。\n抖音：中心化，持续内容产出，流水线运营的MCN。流量变现：包括广告、电商分成。\n听说抖音现在开始精细化运营抖音网红店了，相当于给线下店铺提供抖音短视频营销工具，也算是o2o的变现渠道吧。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //3
          "title": "请你对滴滴地图和高德地图进行简要的竞品分析。", // 问题的标题
          "refer_answer": "滴滴司机端应该是可以设置选择导航的，司机可以选择内置导航（应该就是滴滴导航了吧），也可以选择第三方导航工具。从做这两个地图产品的公司背景来看，滴滴是做出行的，高德是阿里做电商、新零售和o2o的。\n因此不在从功能上做竞品分析:定位不同吧，滴滴是结合区域内司机数量分布，以及潜在打车用户数量分布，对供需进行平衡匹配，其地图功能除了导航以外应更注重对供需的调配。高德除了线路导航外，要结合其o2o，将行驶在路线上的用户导流至路线周边的线下实体消费店。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //4
          "title": "请你说说产品经理和项目经理有什么区别？", // 问题的标题
          "refer_answer": "1、首先，从知识领域来说，项目经理要求技术背景，这是必须的，一般团队的项目经理由非常有项目经验的RD担当，他的职责在于将目标转化为可量化可实现的项目计划，偏重于执行层面。而产品经理的知识领域较泛，且不一定非要求懂技术。\n2、其次，从责任周期来说，项目经理职责有始有终，他可以负责完一个项目后，再无缝切换到另外一个项目，而产品经理基本不能，产品经理随着产品一同成长，产品的成长更迭伴随着无数的项目。\n3、第三、侧重点不同，项目经理关键词：项目、排期、人月；产品经理关键词：需求、用户、产品。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //5
          "title": " 说明一下，摩拜和ofo的功能设计有哪些区别。", // 问题的标题
          "refer_answer": "摩拜：1.强调产品的质量与可靠性、使用体验、注重设计感。2.摩拜在初期就强调产品的创新性和耐用性，将自行车智能硬件化，使用智能锁，轴承动。\nofo：1.强调产品的轻量、便捷，低成本快速生产。2.ofo在初期仅注重产品的可用性，因此采用的多为低成本的单车，后期因为车辆损毁率过高才开始使用智能锁。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //6
          "title": "从产品定位说说QQ和微信的差别。", // 问题的标题
          "refer_answer": "QQ：针对青少年的通讯社交软件，同时满足通讯和交友需求。\n微信：针对各年龄群体的通讯工具，主打熟人通讯，现在已经泛化为提供各种生活服务的平台产品。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //7
          "title": "说出3个获取用户需求的方法并简述其应用的局限性。", // 问题的标题
          "refer_answer": "（1）用户反馈：其局限性在于需要从普通用户较为模糊的表达中，判断用户的典型性及需求的合理性，洞察用户的真实意图。通过用户反馈获取用户需求，缺少统计学支撑，需要较强的判断能力。\n（2）调查问卷：其局限性在于问题设计比较困难。调研经常需要得知被调查者的目的、动机和思考过程，问卷调查却很难把这些方面的问题设计出来。如果问卷设计的问题是开放的，被调查者的回答就容易参差不齐，很难回收，很难用来分析，统计。\n（3）数据分析：其局限性在于缺少场景化、形象化的感知，且数据影响因素较多，难以验证数据变化和需求点优化的正相关性。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //8
          "title": "你觉得为什么淘宝购物需要确认收货，而京东不需要？", // 问题的标题
          "refer_answer": "因为淘宝本质是C2C 的交易撮合平台，作为第三方平台也是信用中介，淘宝需要确认收货来明确买家和卖家的交易完成，从而将暂存在平台的钱款支付给卖家；\n而京东是B2C的交易平台，且以平台自营为主，货款直达商家，商家自身承担着送达货物的责任。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //9
          "title": "你如何看待子弹短信？请简要对比分析微信和子弹短信的优劣势。", // 问题的标题
          "refer_answer": "优势：\n子弹短信:1.用户群体相对细分，因此可以针对目标群体进行优化，满足目标用户对通讯效率细分需求。2.有效分割工作与生活场景。\n微信:1.极大的活跃用户基数;2.丰富全面的使用场景与服务。\n劣势：\n子弹短信:1.用户基数小，用户关系链迁移成本高;2.特色功能缺乏不可替代性和壁垒。\n微信:用户基数大导致产品迭代需要考虑的因素过多，少数群体的需求难以被直接满足 ", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //10
          "title": "从功能特色说说QQ和微信的差别。",
          "refer_answer": "QQ：拥有许多针对青少年的功能，且极具个性化，满足青少年扩展好友圈，展现、表达自己的需求。比如，在聊天时提供更多个性化功能玩法，厘米秀展示自我，同时提供其他功能入口，如动漫电竞直播看点等。\n微信：在致力于提高通讯效率的同时，提供其他生活服务，包括支付、小程序、微信公众号，并开放入口给第三方生活服务，连接人与人，人与信息，人与服务等。  ",
          "note": "",
          "analyse": ""
        }
      ]
    },
    { // 第6套面试题
      "industry": "游戏策划", // 行业
      "count": 9, // 题目数量
      "title": "2020游戏策划类面试精选试题（一）", // 题库标题
      "tip": "", // 题库提示
      "questions": [ // 问题序列
        { // 第一道题
          "title": "请用一分钟的时间介绍一下自己", 
          "refer_answer": "自我介绍的注意事项：\n1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //2
          "title": "请简要列举一个曾经让你付费过或产生强烈付费意愿的游戏功能或活动，并简要分析其原因。", // 问题的标题
          "refer_answer": "王者荣耀的皮肤。\n原因： 完全是视觉效果，而且利用了人类的喜欢攀比，好胜，追求美好的事物的一些心理。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //3
          "title": "拿到一款新游戏的时候，你会从哪些维度去分析？", // 问题的标题
          "refer_answer": "1.游戏本身:\n游戏背景：类型、剧情、人物角色、基本模块要素；\n游戏玩法：规则设定、操作方式、进阶模式、难易度、策略技巧、深度广度；\n游戏体验：视觉体验（场景界面的美感与多样性、画质、流畅度），听觉体验（背景乐、提示音），心理体验（沉浸感、成就感），物理体验（硬件要求，技术支持）。\n2.目标用户与产品定位:\n目标用户：用户画像、用户需求；\n产品定位：调性与特色，功能与价值。3.盈利模式:\n盈利目标、盈利来源；\n竞争对手、运营策略；\n游戏生命周期，可扩展性。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //4
          "title": " 请你评价一下现在游戏的收费模式，各有什么利弊，收费模式分别有：道具收费模式、时长收费模式、买断收费模式。", // 问题的标题
          "refer_answer": "买断收费：对游戏品质要求极高，需要能够达到刺激玩家买单的的水平；后续商业化困难；游戏品质高，购买量大，往往资金回流非常快。同时几乎不需要后续运营，运营成本低。\n时长收费：考验游戏的用户留存，需要游戏有较长的内容和品质留住玩家。这种游戏往往付费层级不明显，玩家的口碑较好，资金回流稳定\n道具收费：玩家口碑一般较差，玩家层级有明显分级，版本迭代需要考虑不同付费层级玩家的感受和需求；盈利高，但对运营的考验也更大。很容易一波流失。在内容和版本迭代要十分注意。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //5
          "title": "你觉得数值策划在网络游戏中起到什么样的作用?", // 问题的标题
          "refer_answer": "数值策划是决定游戏中的元素，以及元素之间关系的一个岗位.\n核心工作是根据系统策划设计的众多元素，设计元素之间的关系，保证玩家的游戏体验，通过后续版本迭代，以游戏体验为核心不断平衡。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //6
          "title": "你觉得任职数值策划应具备哪些素质？", // 问题的标题
          "refer_answer": "1.基本的数理逻辑和概率论方面的知识，同时还要对心理学有一定认知\n2.基本的办公软件word，Excel熟练运用，对Excel各类函数熟悉\n3.对游戏有基本的理解，懂得从游戏体验出发设计数值，而不是单单的摆弄公式脱离体验\n4.沟通能力强，能和系统策划一起完善整个游戏\n5.对游戏有深入理解，懂得从表象推理出背后的数值原因", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //7
          "title": "请列举一个你认为剧情优秀的游戏，并指出它的剧情好在哪里，提炼出可以借鉴的手法。", // 问题的标题
          "refer_answer": "《剑侠情缘网络版三》\n1）世界背景清晰，认知门槛低：世界背景设定为安史之乱前后。\n2）人物设定：人物命运、情节发展与世界大背景息息相关，主线、支线的情节设置都不会产生脱离背景的虚浮感。且门派与门派之间的角色也各具职业特色，有性格相似，但不会脸谱化，每个人物的个性特点鲜明，人物的行为与人物的生长背景吻合。\n3）情节设置：悲剧、喜剧情节的产生和转换合情合理，不强行制造冲突矛盾，代入感强。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //8
          "title": "以东方或西方的神话为基础背景，请你设计一个任意关卡。请先阐述关卡的故事背景，然后再阐述关卡的规则玩法等内容。", // 问题的标题
          "refer_answer": "精卫填海\n炎帝女儿名为女娃游玩东海，溺水而亡，精魄化为一只名叫精卫的鸟，精卫每日衔草木石子扔往东海，填平东海以明心志。\n关卡设置：仿照东海设置地图，boss为精卫。玩家需要在规定时间内击败精卫阻止她衔石填海，精卫生命值低于10%会变为人形态，各属性增益30%。玩家不得使用水系技能攻击，精卫会陷入狂暴状态，持续30min，望周知。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        },
        { //9
          "title": "有600 个人站一排，每次随机杀掉一个奇数位的人，你认为几号最安全。", // 问题的标题
          "refer_answer": "存活回数期望最大的是2，但最可能成为最后一个存活的人是600。M = 600 是个偶数，当杀奇数人的时候，最后一轮排在最后一个位置的人不会被杀，而杀偶数人时，最后这一轮排在最后一个位置的人可能被杀，而就是这一点点差别导致了差异；杀奇数人时，最后一段很容易成为最后一个人，所以存活概率变大了，在杀 599 人的时候，甚至这是唯一的存活可能性；杀偶数人时，反而是成为倒数第二个人比较划算，所以最后一小段反而概率下降了。", // 问题的参考答案
          "note": "", // 备注
          "analyse": "" // 解析
        }
      ]
    }
  
]