export let banks = [
  {// 第一套面试题
    "industry": "学生会", // 行业名称
    "count": 10, // 题目数量
    "title": "学生会面试精选题（一）", // 题库标题
  },
  { // 第2套面试题
    "industry": "学生会", // 行业名称
    "count": 10, // 题目数量
    "title": "学生会面试精选题（二）", // 题库标题
  },
  { // 第3套面试题
    "industry": "学生会", // 行业名称
    "count": 10, // 题目数量
    "title": "学生会面试精选题（三）", // 题库标题
  },
  { // 第4套面试题
    "industry": "学生会", // 行业名称
    "count": 10, // 题目数量
    "title": "学生会面试精选题（四）", // 题库标题
  },
  { // 第5套面试题
    "industry": "学生会", // 行业名称
    "count": 10, // 题目数量
    "title": "学生会面试精选题（五）", // 题库标题
  },
  { // 第6套面试题
    "industry": "C/C++", // 行业名称
    "count": 10, // 题目数量
    "title": "C/C++面试精选试题(一)", // 题库标题
  },
  { // 第7套面试题
    "industry": "C/C++", // 行业名称
    "count": 10, // 题目数量
    "title": "C/C++面试精选试题(二)", // 题库标题
  },
  { // 第8套面试题
    "industry": "Java", // 行业名称
    "count": 10, // 题目数量
    "title": "Java面试精选题（三）", // 题库标题
  },
  { // 第9套面试题
    "industry": "Java", // 行业名称
    "count": 10, // 题目数量
    "title": "Java面试精选题（二）", // 题库标题
  },
  { // 第10套面试题
    "industry": "Java", // 行业名称
    "count": 10, // 题目数量
    "title": "Java面试精选题（一）", // 题库标题
  },
  { // 第11套面试题
    "industry": "机器学习", // 行业名称
    "count": 10, // 题目数量
    "title": "机器学习面试精选试题（二）", // 题库标题
  },
  { // 第12套面试题
    "industry": "机器学习", // 行业名称
    "count": 10, // 题目数量
    "title": "机器学习面试精选试题（一）", // 题库标题
  },
  { // 第13套面试题
    "industry": "前端", // 行业名称
    "count": 10, // 题目数量
    "title": "前端面试精选试题（二）", // 题库标题
  },
  { // 第14套面试题
    "industry": "前端", // 行业名称
    "count": 10, // 题目数量
    "title": "前端面试精选试题（一）", // 题库标题
  },
  { // 第15套面试题
    "industry": "测试工程师", // 行业名称
    "count": 10, // 题目数量
    "title": "测试工程师面试精选试题", // 题库标题
  },
  { // 第16套面试题
    "industry": "运营", // 行业名称
    "count": 10, // 题目数量
    "title": "运营面试精选试题（一）", // 题库标题
  },
  { // 第17套面试题
    "industry": "运营", // 行业名称
    "count": 10, // 题目数量
    "title": "运营面试精选试题（二）", // 题库标题
  },
  { // 第18套面试题
    "industry": "算法工程师", // 行业名称
    "count": 10, // 题目数量
    "title": "算法工程师面试精选试题（二）", // 题库标题
  },
  { // 第19套面试题
    "industry": "算法工程师", // 行业名称
    "count": 10, // 题目数量
    "title": "算法工程师面试精选试题（一）", // 题库标题
  }
]