export let detailBanks = [
  {
    "industry": "测试",
    "title": "高管招聘：常见问题分析",
    "tip": "这是这个题库的总提示",
    "count": 2,
    "questions": [{
        "title": "高管招聘是否成功受很多因素影响，仅仅从面试的方面来看，常见的问题如下：",
        "refer_answer": "一、缺少标准：每个人心中都有标准。但是董事长有董事长的标准，总经理有总经理的标准，部门有部门的标准，人力资源部有人力资源部的标准，这些标准通常都不一致。管理层也没有一起坐下来探讨自己“企业”作为一个“组织”的优秀中高层标准是什么。企业选拔管理者特别是中高层管理者的标准是什么？“德才兼备”是一个常见的答案。但是追问一句：什么是德？回答不上来。这种情况非常多见，要么是没有明确的标准，要么标准都是一些抽象的语句，无法实际操作，不能用来甄别应聘者。\n二、不尊重应聘人员： \n在民营企业中这个问题很常见，有些企业的管理层和招聘人员的素质不高。很多应聘人员都有这种经历，面试官居高临下，语气强硬，好像别人都在求他。国内一家着名网络搜索公司招聘管理人员，公司前台对应聘者态度傲慢，对人爱理不理，通常要让他们在门外等待半小时后才开始面试。面试过程中考官极不耐烦，应聘者一句话没有讲完就被粗暴地打断，很多应聘者发誓再也不进入这家公司工作。 不知这些企业有没有认识到，对于真正有本领的人才来讲，现在是“卖方市场”而非“买方市场”，如果企业不尊重应聘者，那就很难招到合适的人才。\n三、要求过高： \n南方某着名电脑制造商招聘人力资源总监的条件是：10年以上工作经验；名牌大学人力资源管理相关专业毕业；5年以上着名企业人力资源总监工作经验；有思想家的深度、实干家的执行力、演说家的口才等等。但是给的薪水却不高。符合这种条件的人恐怕全国没有几个人，而且有这样的人，也不一定对你的公司感兴趣。 曾经有一家公司招聘总裁办主任，用了各种方式，但是招了一年也没有招到，老板很不高兴。大家会感到很纳闷，但是职位说明书对比，你会吓了一跳，原来这个总裁办职能强大，不但要做战略、计划及预算管理，还要负责分公司的绩效考核，内部审计、法律事务、流程优化、外部公关等等。这样的要求太高，市场上基本无人能胜任，做内部管理和做公共关系对人的要求差别很大，让一个人来负责，很难搞好。\n四、轻易相信应聘人员: \n尽管人们在日常生活中疑心重重，但是在招聘过程中，却会不假思索地相信应聘人员在面试中的回答及简历中的信息，不进行仔细的甄别，或者说没有能力和技术进行甄别。\n其实许多人在应聘职位时，根本就没有长期服务的想法，或者是为了摆脱目前的困境，或者找一家使自己看起来更有面子的公司，以备今后跳槽有资本。出于各种各样的动机，在面试中他们会调整“真相”迎合面试官。一个银行的信贷部门经理想应聘一家高科技公司的职位，当面试官问他是否有风险的承受能力时，他说自己非常喜欢给那些创业期的小型高科技企业贷款。实际上，他在过去的两年中只给两家类似企业贷过款。\n五、党同伐异：结构化面试是指在面试之前，确定好职位要求的能力清单和面试问题，然后在面试中严格根据问题来提问，判断候选人是否符合职位要求。许多面试官在面试过程中会高度评价那些与自己在某方面类似的人，例如同一个学校毕业的人、老乡、家庭背景相同等等，一个北京大学毕业的人做了某个部门的领导，他在招聘员工时总是倾向于招聘北大毕业的人。殊不知，这个职位可能更适合于那些观点或背景与他不同的人。相当数量的面试官，在面试过程中是以自己为标杆来衡量应聘者的。一般来说，越是经验丰富、比较成功的人，越是喜欢以己为标准。这样的结果便是把个人的好恶、价值观以及各方面的能力作为录取的标准。以自己为标准的做法是企业招聘工作不规范的表现。即使有的企业招聘要求非常清晰，也做过多方面的培训，但面试官在招聘中仍然不能按公司的要求行事。根本原因在于面试官是根据自己的理解来运用招聘标准的，如果标准不明确不具体，面试人员更容易以己为标准进行判断。\n六、不当授权：\n大多数管理人员都愿意自己参与招聘过程，但是很多主管人员出于种种原因，把招聘中关键的几步委托给别人完成。典型问题之一是他们要求直接下属或者人力资源部的员工草拟招聘职位的职位说明书，自己却很少参与。另一种错误是，主管人员指派的第一轮面试官要么对面试准备不足、要么动机不端正。更要命的是，有的公司还要小组负责初步面试，这对未来的销售总监来说似乎是奇耻大辱，未来的下属对自己评头论足!\n七、缺乏科学的办法和流程：\n中国企业目前的高管招聘面试一般是这样的：闲谈式对话，从面试官和候选人都熟悉的人到最近的体育比赛、国内外大事都可以成为谈论的话题。当谈到正题时，面试官会不紧不慢地提出几个早在候选人意料之中的问题，候选人不紧不慢地回答。这种面试没有结构，没有既定的流程，也没有既定的考察要素和问题，与其说是面试，不如说是聊天，双方可能会尽兴而归，但面试官对候选人的能力仍然不了解。\n八、忽略情商、深层能力和素质：\n大多数企业在招聘高管时，通常关注一些硬指标（表面指标）——教育背景、家庭背景、年龄、智商、过去工作经历、外表等，很少关注软指标（深层指标），如情商、性格、动机、分析思维能力等。但是，近来研究表明，情商、动机、抽象思维能力等是预测一个人能否胜任某个职位的关键要素。按照着名心理学家丹尼尔·戈尔曼的研究，如果想要取得优秀的工作业绩，情商的重要性是智商和技术能力的两倍。美国着名心理学家麦克利兰教授早在上个世纪70年代就指出，对业绩的最好预测因素不是大学学历等外在条件，而是人的深层素质，如动机等。",
        "note": "这是一条备注",
        "analyse": ""
      },
      {
        "title": "中高层管理人员面试的一些技巧：",
        "refer_answer": "一、董事会、管理人员需要有开放、包容的心态：\n许多企业为什么找来了优秀的管理人才后，短时间马上就流失了呢？原因之一就是企业里面的管理层对外面新来人员的做法容易反感，不认可。很多管理人员思想守旧封闭，认为新来人员是对自己地位的威胁，处处制肘新来的空降兵，使得空降兵难以开展工作。而企业的最高层又没有对老人们进行教育、约束。这就要求最高领导人对老员工和管理人员进行充分的思想教育，使得老员工明白，企业招空降兵的目的不是要区威胁原有管理人员的地位，当然，有的时候，新旧冲突部分原因在于空降兵们的沟通和政治技巧不强，对企业的优良传统重视不够，想一切推倒重来。\n二、充分尊重，敢于授权：\n许多中高级管理人才之所以跳槽，无非是想到新企业施展拳脚，有一番作为。但是许多企业招来了空降兵后，又不敢大胆使用，不敢充分授权，使得空降兵的拳脚难以施展开，这是空降兵迅速流失的一个重要原因。笔者先前所在的一家知名的上市公司这方面就做得非常好。总经理和几个副总都是从著名外企招聘过来的，他们中大多数都在企业已经干了6、7年，带领企业从几千万迅速做到几个亿，可以说非常成功。主要原因就是老板非常信任他们，对他们充分授权，业务基本上不干涉他们。只要是高层管理人员职权范围内的事情，基本上由他们自己决定，不想许多民营企业家那样，虽然聘请了空降兵，但是由对他们职责范围内的工作指手画脚，任意干涉。\n三、对原有的薪酬体系进行调整，充分市场化：\n许多企业在招聘空降兵时，实行的是谈判工资制，远远高于企业内相类似岗位的人。这样企业的薪酬体系就被打乱，企业内部平衡也就被打破。直接导致了原有内部管理人员和新来空降兵的矛盾，导致原有老人的心理极不平衡，对原有老员工的积极性是一种极大的杀伤。这样，“招来一个空降兵，打击一批老员工”，企业往往得不偿失。\n四、战略目标清晰：\n为什么说，企业招聘空降兵前，要战略目标清楚呢？主要是讲企业不能依靠新来的“空降兵”制定公司的战略，确定公司的发展方向。一般来说，要想制定一个科学而又切实可行的企业战略，需要对企业的经营管理现状和企业文化做全面而深入的了解，一个新来的“空降兵”没有半年的时间是很难对企业做这样透彻的了解的，依靠他们制定战略的风险很大。而且，从外面招聘的空降兵（尤其是外企）一般不具备战略管理能力。联想前些年就从著名外企招了一些中高层，希望他们帮助制定科学的战略，但是后来发现他们普遍缺乏这方面的实践经验和训练。所以，企业在招聘空降兵之前最好有了清晰的战略目标，然后招“空降兵”们过来，实现这些目标，在执行战略的过程中不断锻炼他们的战略管理能力，然后再慢慢过渡到让他们帮助制定企业的战略规划。",
        "note": "这是一条备注",
        "analyse": ""
      }
    ]
  }
]