export let banks = [
  {// 第1套面试题
    "industry": "运营", // 行业名称
    "count": 10, // 题目数量
    "title": "运营面试精选题（三）", // 题库标题
  },
  {// 第2套面试题
    "industry": "产品经理", // 行业名称
    "count": 10, // 题目数量
    "title": "产品类面试精选题（一）", // 题库标题
  },
  {// 第3套面试题
    "industry": "产品经理", // 行业名称
    "count": 10, // 题目数量
    "title": "产品类面试精选题（二）", // 题库标题
  },
  {// 第4套面试题
    "industry": "产品经理", // 行业名称
    "count": 10, // 题目数量
    "title": "产品类面试精选题（三）", // 题库标题
  },
  {// 第5套面试题
    "industry": "产品经理", // 行业名称
    "count": 10, // 题目数量
    "title": "产品类面试精选题（四）", // 题库标题
  },
  {// 第6套面试题
    "industry": "游戏策划", // 行业名称
    "count": 9, // 题目数量
    "title": "2020游戏策划类面试精选试题（一）", // 题库标题
  }
]