export let detailBanks = [
  { // 第一套面试题
    "industry": "学生会", // 行业
    "count": 10, // 题目数量
    "title": "学生会面试精选题（一）", // 题库标题
    "tip": "以组织部为主", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { 
        "title": "你为什么要加入学生会？", // 问题的标题
        "refer_answer": "回答这个问题时,一定要积极正面，说白了从两点说就行：一是为了锻炼自己多学东西让自己的大学生活丰富多彩；二是为大家服务，为系里做点什么。个人觉得从这两点答就行。如果你是要加入哪个部门，具体问到哪个部门了你就在多少就这个部门大一点。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { 
        "title": "你觉得你的优势是什么？", // 问题的标题
        "refer_answer": "会一些特长了更好，不会了，可以这样回答。我有三颗心作为我的优势：细心、热心、耐心等。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { 
        "title": " 如果你竞选的部门人太多，你又很优秀，要把你调到其他部门，你愿意去么？", // 问题的标题
        "refer_answer": "这个根据你的意愿了，语言给完善下就行。很多时候也会就一些你竞选的部门提一些问题，你在这之前要多了解下这些部门回答也就没问题了。祝福你朋友。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { 
        "title": "谈谈你对自己的认识。(以组织部为例)", // 问题的标题
        "refer_answer": "该问题主要考察新生是否有培养和发展的潜力，组织部不是一个组织活动的部门，它的职责主要是负责对各班团支部团费收缴，团员证的注册及团员档案管理工作。督促支部过好组织生活，对各班团支部组织生活，团队活动的指导和评估。负责完成院团总支交办的其它事务等等。从以上介绍可以看出组织部的工作非常琐碎，需要塌实有能力和有一定头脑的学生担任！所以组织部招人更看重你是否稳重、有想法、有文笔，是否自信、能独立开展团会的能力等！回答这个问题就要拣自己在这些方面的特长，切不可有什么说什么，要说重点。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { 
        "title": "既然你想入组织部，那你对组织部有什么认识？", // 问题的标题
        "refer_answer": "这个问题考察的是新生对组织部的认识，可以这样回答：根据我对组织部短暂的了解，我发现组织部主要职责是负责对各班团支部团费收缴，团员证的注册及团员档案管理工作。督促支部过好组织生活，对各班团支部组织生活，团队活动的指导和评估。负责完成院团总支交办的其它事务等。通过回答可以给面试官感觉是你是经过对组织部工作的了解才报名组织部面试的，说明你不是盲目的进组织部。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { 
        "title": "在活动中遇到了什么困难，你又是如何解决的? ", // 问题的标题
        "refer_answer": "这个问题要深思熟虑啊，有个技巧，先想想你竞争的部门和岗位，看需要什么样的能力，然后在解决过程中一定要时刻体现，再想想自己设计个什么困难，这样会很有利。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { 
        "title": "假如集体中有你不喜欢的人，你怎么办？", // 问题的标题
        "refer_answer": "这考验人的交际能力和团体协作能力，应该是尽量和别人合作，化解误解！（哈哈！一般都是君子报仇十年不晚！）", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { 
        "title": "怎么协调各个部门的关系？", // 问题的标题
        "refer_answer": "这个问题对于新生不好回答，甚至是学生会的还没弄懂。有些活动我不希望只有一个部门参与，我希望多个部门合作完成，让各部门看到协调合作的重要和益处。也可以设置一些例会，加强各部门特别是部门主管间的沟通。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { 
        "title": "干部最重要的一点是什么？",
        "refer_answer": "进入学生会的同学都是比较优秀的同学，他们就像一台机器的各个部件，要使学生会正常运转必须使各个部件协调工作。干部不可能在各个方面都是最优秀的，所以干部必须具有组织协调能力，让每个优秀的人在合适的位置上得到最大发挥。",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第二套面试题
    "industry": "学生会", // 行业
    "count": 10, // 题目数量
    "title": "学生会面试精选题（二）", // 题库标题
    "tip": "试题涉及宣传部", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第一道题
        "title": "你为什么不选生活部而选我们宣传部？", // 问题的标题
        "refer_answer": "回答也就是因为我喜欢！我喜欢才能热情去做好工作。我对宣传部有更多的了解，至于他要是问有什么了解就靠你编了！", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "对干部有什么认识？ ", // 问题的标题
        "refer_answer": "大学的学习是多方面的，学生会就是一个值得我去学习的优秀集体，对于学社会干部，首先我会很尊敬他们，我相信学生会的干部都有我值得学习的地方，我会虚心的向他们学习。他们不但是我的上级，还是良师益友，我把他们当作我的老师和朋友！ ", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "认识我吗？谈谈对我的认识？", // 问题的标题
        "refer_answer": "我对学姐（学长）并没有一个长时间的相处，所以我无法有个具体准确的认识。因为是学生会的前辈，所以我认为是应该是值得我尊敬和学习的。从第一影响来看，你是个和善，开朗，善于交往，照顾新人的人。这个答案是比较新颖的，可以用吧！", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "你的座右铭是什么？", // 问题的标题
        "refer_answer": "思路：1、座右铭能在一定程度上反映应聘者的性格、观念、心态，这是面试官问这个问题的主要原因。 2、不宜说那些医引起不好联想的座右铭。 3、不宜说那些太抽象的座右铭。 4、不宜说太长的座右铭。 5、座右铭最好能反映出自己某种优秀品质。 6、 参考答案——“只为成功找方法，不为失败找借口。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "如果你这次没有进入@@部呢？", // 问题的标题
        "refer_answer": "如果这次未能当选，我会一如既往地努力做好本职工作，同时积极支持学生会的各项工作。我也会一如既往地加紧学习，充实自己，提高自己，下一次我依然会来竞选。那时，再接受老师和同学们的检阅。我一定会交一份满意的答卷！” 记得最后结束要说“谢谢！” 总之问的问题一般不是是非问题 没有标准答案，你往高标准上回答，说点好听的，一般就OK。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "你为什么要加入@@部？(判断 沟通能力和口才) 你对@@部了解有多少？", // 问题的标题
        "refer_answer": "回答这个问题时，一定要积极正面，如想要使自己能有更好的发展空间，希望能在相关领域中有所发展，希望能在学@@多多学习等等﹔此时可以稍稍夸一下@@部，但切记一定要诚恳，不然可是会画蛇添足，得不偿失哦！所以建议你可以坦承的说出自己的动机，不过用语还是要思考一下。\n这时准备的功夫就派上用场，看应聘者能否将之前所吸收的信息发挥出来！至少也要知道学习部的具体工作，不然一问当场傻在那儿就糗大了！", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "我们这个部的工作很XX的,你能做过来么？", // 问题的标题
        "refer_answer": "当然说可以啊，，不要含糊，要显得有自信。当然你还要具体发挥你会怎么做？", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "你学习紧要么？你学习那么紧,还进来学生会干吗？ (加入部门的目的)", // 问题的标题
        "refer_answer": "回答这个问题就要了解学生会的宗旨是全心全意的为同学服务，然后积极的表明自己是来服务同学，而不是被同学服务的对象，并且表示希望在为大家服务的同时，自己的能力和认识也不断的提高。你的回答是双赢的，既说明进入的原因，又说出自己的目的，不一味地表示无私地奉献，不会给人做作的感觉。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "你怎么处理学习与工作的关系？如果学习与工作发生冲突你会怎么处理？（应变能力）", // 问题的标题
        "refer_answer": "这个问题我会好好利用课堂时间学习，课下多复习。工作我会抽出课下和业余时间来做。如果有冲突尽量会和会里的同学协商做一下简单的调整。他要是死缠着问，你就说一定会尽量和别人调下，先做学习上的，毕竟学生的本职工作就是学习。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      }
    ]
  },
  { // 第3套面试题
    "industry": "学生会", // 行业
    "count": 10, // 题目数量
    "title": "学生会面试精选题（三）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第一道题
        "title": "你进入学生会后有什么设想？（看有无目标）", // 问题的标题
        "refer_answer": "一开始你肯定有个意向的部门，你要之前熟悉打听下这个部门的工作情况，然后自己简单的有个设想就成，也别多伟大，简单的就行。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "你哪方面比较擅长？（口才、英语、体育方面优秀者优先考虑）", // 问题的标题
        "refer_answer": "音乐、体育、舞蹈、组织协调能力、沟通表达能力、口才、写作等看你个人了。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "你高中阶段有没有担任什么职务，这些工作对你影响？你在做学生工作中碰到的令你棘手的问题是什么？", // 问题的标题
        "refer_answer": "这个问题主要是考察你有没有经验，如果高中阶段有担任某些职务当然好，没有就回答没有，要不还会问你担任的感受，以及对你的影响等等。如果被看出是撒谎，那么不但对你的印象不好，估计接下来的面试也困难重重！ ", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "谈谈你对@@部的认识？", // 问题的标题
        "refer_answer": "这个问题主要看你是否有培养和发展的潜力，@@部不是一个组织学习的部门，它的主要职责是负责招人更看重你是否稳重，有头脑，自信，能独立开展和组织活动的能力！回答这个问题就要拣自己在这些方面的特长，切不可有什么说什么，没有重点。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "你进学生会的目的是什么？", // 问题的标题
        "refer_answer": "学生会是联系学校和同学的纽带，是一个为同学服务的机构，也是一个锻炼自我展现自我的平台。进入学生会可以更好的发挥我的特长，为同学服务，并在工作中发现我的不足，提高自己充实自己！", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "谈谈你对学生会的理解和认识？", // 问题的标题
        "refer_answer": "学生会的宗旨是全心全意的为同学服务，首先要积极的表明自己是来服务同学，并且在为大家服务的同时自己的能力和认识也不断的提高，你的回答是双赢的，不会给人做作的感觉。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "如果你进了学生会，怎么处理好学习和工作，干部和学生的关系？", // 问题的标题
        "refer_answer": "大学里的学习是多方面的，学生会就是一个值得我去学习的优秀集体，相信在学生会里我能更快的提高，也能更好的学习。这个问题很尖锐，可以不正面回答。是我的部长把我带入这个优秀的集体，首先我会很尊敬他，我相信学生会的干部都有我值得学习的地方，我会很虚心的向他们学习，并尽我的努力去完成学生会的工作。他们不但是我的上级，还是我的良师益友，我把他们当作我的学长和朋友！", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "谈谈你曾经组织或参加活动的经验和教训！", // 问题的标题
        "refer_answer": "对于这个问题不要乱吹，有经验谈经验，没有经验就谈谈你见到或听到过的一些失败的经验对自己的启发，切不可直接说没有，没有经历的人，会让人怀疑他的能力和观察力。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "对你影响最深的一个人！（回答的人一定要给你有很深的影响！）",
        "refer_answer": "当然你回答的人一定要给你有很深的影响，而且在回答的时候要表现出对此人的感情！当然泪流满面，我就觉得就有点作了，里面的都是人精，谁看不出来你是装的啊！亲情牌慎用！催泪等等慎用！",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第四套面试题
    "industry": "学生会", // 行业
    "count": 10, // 题目数量
    "title": "学生会面试精选题（四）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "自己的优缺点为何？", // 问题的标题
        "refer_answer": "目的是在于检视人才是否适当，应聘者的诚恳度等等，看应聘者有无好好分析自己，在回答问题时，以优点作为主要诉求。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "你有什么业余爱好？", // 问题的标题
        "refer_answer": "业余爱好能在一定程度上反映应聘者的性格、观念、心态，这是招聘问该问题的主要原因。最好不要说自己没有业余爱好。不要说自己有那些庸俗的、令人感觉不好的爱好。最好不要说自己仅限于读书、听音乐、上网，否则可能令面试官怀疑应聘者性格孤僻。、最好能有一些户外的业余爱好来“点缀”你的形象。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "你最崇拜谁？", // 问题的标题
        "refer_answer": "最崇拜的人能在一定程度上反映应聘者的性格、观念、心态。不宜说自己谁都不崇拜。不宜说崇拜自己。不宜说崇拜一个虚幻的、或是不知名的人。不宜说崇拜一个明显具有负面形象的人。所崇拜的人人最好与自己所应聘的工作能“搭”上关系。最好说出自己所崇拜的人的哪些品质、哪些思想感染着自己、鼓舞着自己。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "谈谈你的缺点 不宜说自己没缺点。", // 问题的标题
        "refer_answer": "不宜把那些明显的优点说成缺点。不宜说出严重影响所应聘工作的缺点。不宜说出令人不放心、不舒服的缺点。可以说出一些对于所应聘工作“无关紧要”的缺点，甚至是一些表面上看是缺点，从工作的角度看却是优点的缺点。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "谈一谈你的一次失败经历！", // 问题的标题
        "refer_answer": "不宜说自己没有失败的经历。不宜把那些明显的成功说成是失败。不宜说出严重影响所应聘工作的失败经历，所谈经历的结果应是失败的。宜说明失败之前自己曾信心白倍、尽心尽力。说明仅仅是由于外在客观原因导致失败。失败后自己很快振作起来，以更加饱满的热情面对以后的工作。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": " 对@@部的工作，你有哪些可预见的困难？", // 问题的标题
        "refer_answer": "不宜直接说出具体的困难，否则可能令对方怀疑应聘者不行。可以尝试迂回战术，说出应聘者对困难所持有的态度——“工作中出现一些困难是正常的，也是难免的，但是只要有坚忍不拔的毅力、良好的合作精神以及事前周密而充分的准备，任何困难都是可以克服的。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "与上级意见不一是，你将怎么办？", // 问题的标题
        "refer_answer": "一般可以这样回答“我会给上级以必要的解释和提醒，在这种情况下，我会服从上级的意见。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "你希望与什么样的上级共事？", // 问题的标题
        "refer_answer": "a. 通过应聘者对上级的“希望”可以判断出应聘者对自我要求的意识，这既上一个陷阱，又上一次机会。b. 最好回避对上级具体的希望，多谈对自己的要求。c. 如“做为刚步入社会新人，我应该多要求自己尽快熟悉环境、适应环境，而不应该对环境提出什么要求，只要能发挥我的专长就可以了。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "喜欢@@部的哪一点？哪些方面？（考察对学习部的认识）",
        "refer_answer": "相信其实大家心中一定都有答案了吧！每个人的价值观不同，自然评断的标准也会不同，但是，在回答面试官这个问题时可不能太直接就把自己心理的话说出来，不过一些无伤大雅的回答是不错的考虑，如工作性质及内容颇能符合自己的兴趣等等都是不错的答案，不过如果这时自己能仔细思考出这份工作的与众不同之处，相信在面试上会大大加分。",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第五套面试题
    "industry": "学生会", // 行业
    "count": 7, // 题目数量
    "title": "学生会面试精选试题（五）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "你想要入学生会，你奶奶知道了，但她不知道什么是学生会，不知道你为什么要去，你怎么解释给你的奶奶听？（实际问题是：你对学生会的理解和认识？你进学生会的目的是什么？ ）", // 问题的标题
        "refer_answer": "宗旨当然是全心全意的为同学服务，并且在为大家服务的同时自己的能力和认识也不断的提高，同时看这位同学的回答是不是很做作、虚假。看是否有培养和发展的潜力，面对工作的琐碎繁多，是不是能塌实、有能力、自信、有一定头脑！能否独立开展活动的能力，说话表述有没有抓住重点。学生会是联系学校和同学的纽带，是一个为同学服务的机构，也是一个锻炼自我展现自我的平台。进入学生会可以更好的发挥我的特长，为同学服务，并在工作中发现自我的不足，提高自己充实自己！", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "上大学已经一个多月了，总结以下你对大学的认识，你对大学的印象。", // 问题的标题
        "refer_answer": "考察学生的语言组织能力，可以看出学生的活泼程度", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "假设你被招入学生会后，感觉同为干事的他们很受部长们的重视，而你却被冷落，这时你会怎么做？", // 问题的标题
        "refer_answer": "这个题的出现很意外，也很正常。一般学生可能不会想到这个题，但我只能说这是我的一个亲身经历，我想这也许也是每一个干事将要面对的事。当然，我在题中有意加了 “感觉”这个词，是为了让参报者先从自己的角度出发，反思自己是否是多虑了，然后再从自身能力以及自我推荐等方面阐述自己的观点。不过参加笔试的同学似乎没有人注意到，也许，我的出题的确有点问题。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "谈谈你对我出的面试问题的看法！", // 问题的标题
        "refer_answer": "自认为是个不错的题，给人意外的题目往往能够看出一个人的应变能力。同时，这个题还能较好地反应出参报者的分析能力。以我出的题目作为讨论的对象，能看出此人在考官的压力下（实际并不存在），能否依然持有自己的态度并勇敢地表达出来。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "你对学生会是怎么看的这个集体的？", // 问题的标题
        "refer_answer": "学生会是一个集体，我们学生会每一个成员都要时刻维护学生会的优良形象，做好模范带好头。要时时以身作则，处处树立榜样，秉公办理各类事情，不能有丝毫的私心，要敢于批评与自我批评，善于听取不同意见，完善自己，促进工作。不但在同学们中树立自己的良好形象，而且要让同学们充分信任学生会，这一切要求我们努力努力再努力。当然，这一切都要首先从我自己做起，经得起检验与考验。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": " 如果你这次没有进入学生会@@部门呢？", // 问题的标题
        "refer_answer": "如果这次未能当选,我会一如既往地努力做好本职工作,同时积极支持学生会的各项工作。我也会一如既往地加紧学习,充实自己,提高自己,下一次我依然会来竞选。那时,再接受老师和同学们的检阅。我一定会交一份满意的答卷!“ 记得最后结束要说”谢谢!“ 总之问的问题一般不是是非问题 没有标准答案，你往高标准上回答，说点好听的，一般就OK。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { 
        "title": "你对学生会是怎么看的？对于学生会你有什么想法？", // 问题的标题
        "refer_answer": "学生会是一个集体，我们学生会每一个成员都要时刻维护学生会的优良形象，做好模范带好头。要时时以身作则，处处树立榜样，秉公办理各类事情，不能有丝毫的私心，要敢于批评与自我批评，善于听取不同意见，完善自己，促进工作。不但在同学们中树立自己的良好形象，而且要让同学们充分信任学生会，这一切要求我们努力努力再努力。当然，这一切都要首先从我自己做起，经得起检验与考验。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "对你影响最深的一句话！", // 问题的标题
        "refer_answer": "如果你实在想不起来，就找一句比较经典的什么老子，孔子，道家等等的话都可以，当然你要理解着句话，能讲出道理来！", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "你怎么协调各个部之间的关系？（处事能力）",
        "refer_answer": "其实在学生会里各个部门有一定得排斥性，关键是要将各个部门的成员彼此熟悉，如果是在同一专业里的人即使是在不同的部门也能相处的好，而你要做的就是让他们彼此尽快熟悉起来，部门之间的联系最重要。",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第6套面试题
    "industry": "C/C++", // 行业
    "count": 10, // 题目数量
    "title": "C/C++面试精选试题(一)", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "说一下C++中static关键字的作用", // 问题的标题
        "refer_answer": "对于函数定义和代码块之外的变量声明，static修改标识符的链接属性，由默认的external变为internal，作用域和存储类型不改变，这些符号只能在声明它们的源文件中访问。\n对于代码块内部的变量声明，static修改标识符的存储类型，由自动变量改为静态变量，作用域和链接属性不变。这种变量在程序执行之前就创建，在程序执行的整个周期都存在。\n对于被static修饰的普通函数，其只能在定义它的源文件中使用，不能在其他源文件中被引用\n对于被static修饰的类成员变量和成员函数，它们是属于类的，而不是某个对象，所有对象共享一个静态成员。静态成员通过<类名>::<静态成员>来使用。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "请说一下C/C++ 中指针和引用的区别？", // 问题的标题
        "refer_answer": "1.指针有自己的一块空间，而引用只是一个别名；\n2.使用sizeof看一个指针的大小是4，而引用则是被引用对象的大小；\n3.指针可以被初始化为NULL，而引用必须被初始化且必须是一个已有对象 的引用；\n4.作为参数传递时，指针需要被解引用才可以对对象进行操作，而直接对引 用的修改都会改变引用所指向的对象；\n5.可以有const指针，但是没有const引用；\n6.指针在使用中可以指向其它对象，但是引用只能是一个对象的引用，不能 被改变；\n7.指针可以有多级指针（**p），而引用至于一级；\n8.指针和引用使用++运算符的意义不一样；\n9.如果返回动态内存分配的对象或者内存，必须使用指针，引用可能引起内存泄露。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "请你回答一下野指针是什么？", // 问题的标题
        "refer_answer": "野指针就是指向一个已删除的对象或者未申请访问受限内存区域的指针.", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "请你介绍一下C++中的智能指针", // 问题的标题
        "refer_answer": "智能指针主要用于管理在堆上分配的内存，它将普通的指针封装为一个栈对象。当栈对象的生存周期结束后，会在析构函数中释放掉申请的内存，从而防止内存泄漏。C++ 11中最常用的智能指针类型为shared_ptr,它采用引用计数的方法，记录当前内存资源被多少个智能指针引用。该引用计数的内存在堆上分配。当新增一个时引用计数加1，当过期时引用计数减一。只有引用计数为0时，智能指针才会自动释放引用的内存资源。对shared_ptr进行初始化时不能将一个普通指针直接赋值给智能指针，因为一个是指针，一个是类。可以通过make_shared函数或者通过构造函数传入普通指针。并可以通过get函数获得普通指针。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "请你来说一下智能指针的内存泄漏如何解决", // 问题的标题
        "refer_answer": "为了解决循环引用导致的内存泄漏，引入了weak_ptr弱指针，weak_ptr的构造函数不会修改引用计数的值，从而不会对对象的内存进行管理，其类似一个普通指针，但不指向引用计数的共享内存，但是其可以检测到所管理的对象是否已经被释放，从而避免非法访问。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "请你回答一下为什么析构函数必须是虚函数？为什么C++默认的析构函数不是虚函数 ", // 问题的标题
        "refer_answer": "将可能会被继承的父类的析构函数设置为虚函数，可以保证当我们new一个子类，然后使用基类指针指向该子类对象，释放基类指针时可以释放掉子类的空间，防止内存泄漏。\nC++默认的析构函数不是虚函数是因为虚函数需要额外的虚函数表和虚表指针，占用额外的内存。而对于不会被继承的类来说，其析构函数如果是虚函数，就会浪费内存。因此C++默认的析构函数不是虚函数，而是只有当需要当作父类时，设置为虚函数。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "请你来说一下静态函数和虚函数的区别", // 问题的标题
        "refer_answer": "静态函数在编译的时候就已经确定运行时机，虚函数在运行的时候动态绑定。虚函数因为用了虚函数表机制，调用的时候会增加一次内存开销.", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "请你来说一说重载和覆盖", // 问题的标题
        "refer_answer": "重载：两个函数名相同，但是参数列表不同（个数，类型），返回值类型没有要求，在同一作用域中.\n 重写：子类继承了父类，父类中的函数是虚函数，在子类中重新定义了这个虚函数，这种情况是重写", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "请你来回答一下++i和i++的区别",
        "refer_answer": "++i先自增1，再返回，i++先返回i,再自增1",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第7套面试题
    "industry": "C/C++", // 行业
    "count": 10, // 题目数量
    "title": "C/C++面试精选试题(二)", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "请你来说一说隐式类型转换", // 问题的标题
        "refer_answer": "首先，对于内置类型，低精度的变量给高精度变量赋值会发生隐式类型转换，其次，对于只存在单个参数的构造函数的对象构造来说，函数调用可以直接使用该参数传入，编译器会自动调用其构造函数生成临时对象。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "请你来回答一下const修饰成员函数的目的是什么？", // 问题的标题
        "refer_answer": "const修饰的成员函数表明函数调用不会对对象做出任何更改，事实上，如果确认不会对对象做更改，就应该为函数加上const限定，这样无论const对象还是普通对象都可以调用该函数。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "请你说说虚函数表具体是怎样实现运行时多态的?", // 问题的标题
        "refer_answer": "子类若重写父类虚函数，虚函数表中，该函数的地址会被替换，对于存在虚函数的类的对象，在VS中，对象的对象模型的头部存放指向虚函数表的指针，通过该机制实现多态。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "请你说说C语言是怎么进行函数调用的？", // 问题的标题
        "refer_answer": "每一个函数调用都会分配函数栈，在栈内进行函数执行过程。调用前，先把返回地址压栈，然后把当前函数的esp指针压栈。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "请你回答一下C++中拷贝赋值函数的形参能否进行值传递？", // 问题的标题
        "refer_answer": "不能。如果是这种情况下，调用拷贝构造函数的时候，首先要将实参传递给形参，这个传递的时候又要调用拷贝构造函数。。如此循环，无法完成拷贝，栈也会满。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "请你说一说select", // 问题的标题
        "refer_answer": "select在使用前，先将需要监控的描述符对应的bit位置1，然后将其传给select,当有任何一个事件发生时，select将会返回所有的描述符，需要在应用程序自己遍历去检查哪个描述符上有事件发生，效率很低，并且其不断在内核态和用户态进行描述符的拷贝，开销很大", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "请你来说一下什么时候会发生段错误", // 问题的标题
        "refer_answer": "段错误通常发生在访问非法内存地址的时候，具体来说分为以下几种情况：\n使用野指针\n试图修改字符串常量的内容", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "请你来说一下C++中struct和class的区别", // 问题的标题
        "refer_answer": "在C++中，可以用struct和class定义类，都可以继承。区别在于：structural的默认继承权限和默认访问权限是public，而class的默认继承权限和默认访问权限是private。\n另外，class还可以定义模板类形参，比如template <class T, int i>。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "请你回答一下C++类内可以定义引用数据成员吗？",
        "refer_answer": "可以，必须通过成员函数初始化列表初始化。",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第8套面试题
    "industry": "Java", // 行业
    "count": 10, // 题目数量
    "title": "Java面试精选题（三）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "请你说明一下，在Java中如何跳出当前的多重嵌套循环？", // 问题的标题
        "refer_answer": "在最外层循环前加一个标记如A，然后用break A;可以跳出多重循环。（Java中支持带标签的break和continue语句，作用有点类似于C和C++中的goto语句，但是就像要避免使用goto一样，应该避免使用带标签的break和continue，因为它不会让你的程序变得更优雅，很多时候甚至有相反的作用，所以这种语法其实不知道更好），根本不能进行字符串的equals比较，否则会产生NullPointerException异常。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "请你简单描述一下正则表达式及其用途。", // 问题的标题
        "refer_answer": "在编写处理字符串的程序时，经常会有查找符合某些复杂规则的字符串的需要。正则表达式就是用于描述这些规则的工具。换句话说，正则表达式就是记录文本规则的代码。计算机处理的信息更多的时候不是数值而是字符串，正则表达式就是在进行字符串匹配和处理的时候最为强大的工具，绝大多数语言都提供了对正则表达式的支持。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "请你说明String 和StringBuffer的区别", // 问题的标题
        "refer_answer": "JAVA 平台提供了两个类：String和StringBuffer，它们可以储存和操作字符串，即包含多个字符的字符数据。这个String类提供了数值不可改变的字符串。而这个StringBuffer类提供的字符串进行修改。当你知道字符数据要改变的时候你就可以使用StringBuffer。典型地，你可以使用StringBuffers来动态构造字符数据。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": " 请说明String是最基本的数据类型吗?", // 问题的标题
        "refer_answer": "基本数据类型包括byte、int、char、long、float、double、boolean和short。\njava.lang.String类是final类型的，因此不可以继承这个类、不能修改这个类。为了提高效率节省空间，我们应该用StringBuffer类。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "请你讲讲数组(Array)和列表(ArrayList)的区别？什么时候应该使用Array而不是ArrayList？", // 问题的标题
        "refer_answer": "Array和ArrayList的不同点：\nArray可以包含基本类型和对象类型，ArrayList只能包含对象类型。\nArray大小是固定的，ArrayList的大小是动态变化的。\nArrayList提供了更多的方法和特性，比如：addAll()，removeAll()，iterator()等等。\n对于基本类型数据，集合使用自动装箱来减少编码工作量。但是，当处理固定大小的基本数据类型的时候，这种方式相对比较慢。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "请你解释什么是值传递和引用传递？", // 问题的标题
        "refer_answer": "值传递是对基本型变量而言的,传递的是该变量的一个副本,改变副本不影响原变量.\n引用传递一般是对于对象型变量而言的,传递的是该对象地址的一个副本, 并不是原对象本身 。 所以对引用对象进行操作会同时改变原对象.\n一般认为,java内的传递都是值传递.", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "请你解释为什么会出现4.0-3.6=0.40000001这种现象？", // 问题的标题
        "refer_answer": "原因简单来说是这样：2进制的小数无法精确的表达10进制小数，计算机在计算10进制小数的过程中要先转换为2进制进行计算，这个过程中出现了误差。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "请你说说Lamda表达式的优点。", // 问题的标题
        "refer_answer": "优点：1. 简洁。2. 非常容易并行计算。3. 可能代表未来的编程趋势。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "请你说说Lamda表达式的缺点。",
        "refer_answer": "缺点：1. 若不用并行计算，很多时候计算速度没有比传统的 for 循环快。（并行计算有时需要预热才显示出效率优势）2. 不容易调试。3. 若其他程序员没有学过 lambda 表达式，代码不容易让其他语言的程序员看懂。",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第9套面试题
    "industry": "Java", // 行业
    "count": 10, // 题目数量
    "title": "Java面试精选试题（二）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "请你解释为什么重写equals还要重写hashcode？", // 问题的标题
        "refer_answer": "HashMap中，如果要比较key是否相等，要同时使用这两个函数！因为自定义的类的hashcode()方法继承于Object类，其hashcode码为默认的内存地址，这样即便有相同含义的两个对象，比较也是不相等的。HashMap中的比较key是这样的，先求出key的hashcode(),比较其值是否相等，若相等再比较equals(),若相等则认为他们是相等的。若equals()不相等则认为他们不相等。如果只重写hashcode()不重写equals()方法，当比较equals()时只是看他们是否为同一对象（即进行内存地址的比较）,所以必定要两个方法一起重写。HashMap用来判断key是否相等的方法，其实是调用了HashSet判断加入元素 是否相等。重载hashCode()是为了对同一个key，能得到相同的Hash Code，这样HashMap就可以定位到我们指定的key上。重载equals()是为了向HashMap表明当前对象和key上所保存的对象是相等的，这样我们才真正地获得了这个key所对应的这个键值对。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "请你讲讲一个十进制的数在内存中是怎么存的？", // 问题的标题
        "refer_answer": "补码的形式。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "请你解释Object若不重写hashCode()的话，hashCode()如何计算出来的？", // 问题的标题
        "refer_answer": "Object 的 hashcode 方法是本地方法，也就是用 c 语言或 c++ 实现的，该方法直接返回对象的 内存地址。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "请你介绍一下volatile？", // 问题的标题
        "refer_answer": "volatile关键字是用来保证有序性和可见性的。这跟Java内存模型有关。比如我们所写的代码，不一定是按照我们自己书写的顺序来执行的，编译器会做重排序，CPU也会做重排序的，这样的重排序是为了减少流水线的阻塞的，引起流水阻塞，比如数据相关性，提高CPU的执行效率。需要有一定的顺序和规则来保证，不然程序员自己写的代码都不知带对不对了，所以有happens-before规则，其中有条就是volatile变量规则：对一个变量的写操作先行发生于后面对这个变量的读操作；有序性实现的是通过插入内存屏障来保证的。可见性：首先Java内存模型分为，主内存，工作内存。比如线程A从主内存把变量从主内存读到了自己的工作内存中，做了加1的操作，但是此时没有将i的最新值刷新会主内存中，线程B此时读到的还是i的旧值。加了volatile关键字的代码生成的汇编代码发现，会多出一个lock前缀指令。Lock指令对Intel平台的CPU，早期是锁总线，这样代价太高了，后面提出了缓存一致性协议，MESI，来保证了多核之间数据不一致性问题。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "请你谈谈关于Synchronized和lock ", // 问题的标题
        "refer_answer": "synchronized是Java的关键字，当它用来修饰一个方法或者一个代码块的时候，能够保证在同一时刻最多只有一个线程执行该段代码。JDK1.5以后引入了自旋锁、锁粗化、轻量级锁，偏向锁来有优化关键字的性能。\nLock是一个接口，而synchronized是Java中的关键字，synchronized是内置的语言实现；synchronized在发生异常时，会自动释放线程占有的锁，因此不会导致死锁现象发生；而Lock在发生异常时，如果没有主动通过unLock()去释放锁，则很可能造成死锁现象，因此使用Lock时需要在finally块中释放锁；Lock可以让等待锁的线程响应中断，而synchronized却不行，使用synchronized时，等待的线程会一直等待下去，不能够响应中断；通过Lock可以知道有没有成功获取锁，而synchronized却无法办到。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "请你介绍一下Syncronized锁，如果用这个关键字修饰一个静态方法，锁住了什么？如果修饰成员方法，锁住了什么？", // 问题的标题
        "refer_answer": "synchronized修饰静态方法以及同步代码块的synchronized (类.class)用法锁的是类，线程想要执行对应同步代码，需要获得类锁。\n synchronized修饰成员方法，线程获取的是当前调用该方法的对象实例的对象锁。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "请说明重载（Overload）和重写（Override）的区别。重载的方法能否根据返回类型进行区分？", // 问题的标题
        "refer_answer": "方法的重载和重写都是实现多态的方式，区别在于前者实现的是编译时的多态性，而后者实现的是运行时的多态性。重载发生在一个类中，同名的方法如果有不同的参数列表（参数类型不同、参数个数不同或者二者都不同）则视为重载；重写发生在子类与父类之间，重写要求子类被重写方法与父类被重写方法有相同的返回类型，比父类被重写方法更好访问，不能比父类被重写方法声明更多的异常（里氏代换原则）。重载对返回类型没有特殊的要求。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "请说明内部类可以引用他包含类的成员吗，如果可以，有没有什么限制吗？", // 问题的标题
        "refer_answer": "一个内部类对象可以访问创建它的外部类对象的内容，内部类如果不是static的，那么它可以访问创建它的外部类对象的所有属性内部类如果是sattic的，即为nested class，那么它只可以访问创建它的外部类对象的所有static属性一般普通类只有public或package的访问修饰，而内部类可以实现static，protected，private等访问修饰。当从外部类继承的时候，内部类是不会被覆盖的，它们是完全独立的实体，每个都在自己的命名空间内，如果从内部类中明确地继承，就可以覆盖原来内部类的方法。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "请说明Java的接口和C++的虚类的相同和不同处。",
        "refer_answer": "由于Java不支持多继承，而有可能某个类或对象要使用分别在几个类或对象里面的方法或属性，现有的单继承机制就不能满足要求。\n与继承相比，接口有更高的灵活性，因为接口中没有任何实现代码。当一个类实现了接口以后，该类要实现接口里面所有的方法和属性，并且接口里面的属性在默认状态下面都是public static,所有方法默认情况下是public.一个类可以实现多个接口。",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第10套面试题
    "industry": "Java", // 行业
    "count": 10, // 题目数量
    "title": "Java面试精选试题（一）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "请判断当一个对象被当作参数传递给一个方法后，此方法可改变这个对象的属性，并可返回变化后的结果，那么这里到底是值传递还是引用传递?", // 问题的标题
        "refer_answer": "是值传递。Java 编程语言只有值传递参数。当一个对象实例作为一个参数被传递到方法中时，参数的值就是对该对象的引用。对象的内容可以在被调用的方法中改变，但对象的引用是永远不会改变的。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "请说明Java是否支持多继承？", // 问题的标题
        "refer_answer": "Java中类不支持多继承，只支持单继承（即一个类只有一个父类）。 但是java中的接口支持多继承，，即一个子接口可以有多个父接口。（接口的作用是用来扩展对象的功能，一个子接口继承多个父接口，说明子接口扩展了多个功能，当类实现接口时，类就扩展了相应的功能）。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": " 请讲讲Java有哪些特性，并举一个和多态有关的例子。", // 问题的标题
        "refer_answer": "封装、继承、多态。\n多态：指允许不同类的对象对同一消息做出响应。即同一消息可以根据发送对象的不同而采用多种不同的行为方式。（发送消息就是函数调用）", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "请说明List、Map、Set三个接口存取元素时，各有什么特点？", // 问题的标题
        "refer_answer": "List以特定索引来存取元素，可以有重复元素。Set不能存放重复元素（用对象的equals()方法来区分元素是否重复）。Map保存键值对（key-value pair）映射，映射关系可以是一对一或多对一。Set和Map容器都有基于哈希存储和排序树的两种实现版本，基于哈希存储的版本理论存取时间复杂度为O(1)，而基于排序树版本的实现在插入或删除元素时会按照元素或元素的键（key）构成排序树从而达到排序和去重的效果。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "请说明ArrayList是否会越界？", // 问题的标题
        "refer_answer": "ArrayList是实现了基于动态数组的数据结构，而LinkedList是基于链表的数据结构2. 对于随机访问get和set，ArrayList要优于LinkedList，因为LinkedList要移动指针；ArrayList并发add()可能出现数组下标越界异常。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "如何保证线程安全？", // 问题的标题
        "refer_answer": "通过合理的时间调度，避开共享资源的存取冲突。另外，在并行任务设计上可以通过适当的策略，保证任务与任务之间不存在共享资源，设计一个规则来保证一个客户的计算工作和数据访问只会被一个线程或一台工作机完成，而不是把一个客户的计算工作分配给多个线程去完成。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "请说明一下线程池有什么优势？", // 问题的标题
        "refer_answer": "第一：降低资源消耗。通过重复利用已创建的线程降低线程创建和销毁造成的消耗。\n第二：提高响应速度。当任务到达时，任务可以不需要等到线程创建就能执行。\n第三：提高线程的可管理性，线程是稀缺资源，如果无限制地创建，不仅会消耗系统资源，还会降低系统的稳定性，使用线程池可以进行统一分配、调优和监控。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "请问什么是死锁(deadlock)?", // 问题的标题
        "refer_answer": "两个线程或两个以上线程都在等待对方执行完毕才能继续往下执行的时候就发生了死锁。结果就是这些线程都陷入了无限的等待中。\n例如，如果线程1锁住了A，然后尝试对B进行加锁，同时线程2已经锁住了B，接着尝试对A进行加锁，这时死锁就发生了。线程1永远得不到B，线程2也永远得不到A，并且它们永远也不会知道发生了这样的事情。为了得到彼此的对象（A和B），它们将永远阻塞下去。这种情况就是一个死锁。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "请说明一下synchronized的可重入怎么实现。",
        "refer_answer": "每个锁关联一个线程持有者和一个计数器。当计数器为0时表示该锁没有被任何线程持有，那么任何线程都都可能获得该锁而调用相应方法。当一个线程请求成功后，JVM会记下持有锁的线程，并将计数器计为1。此时其他线程请求该锁，则必须等待。而该持有锁的线程如果再次请求这个锁，就可以再次拿到这个锁，同时计数器会递增。当线程退出一个synchronized方法/块时，计数器会递减，如果计数器为0则释放该锁。",
        "note": "",
        "analyse": ""
      }
    ]
  }, 
  { // 第11套面试题
    "industry": "机器学习", // 行业
    "count": 10, // 题目数量
    "title": "机器学习面试精选试题（二）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "循环神经网络，为什么好?", // 问题的标题
        "refer_answer": "循环神经网络模型（RNN）是一种节点定向连接成环的人工神经网络，是一种反馈神经网络，RNN利用内部的记忆来处理任意时序的输入序列，并且在其处理单元之间既有内部的反馈连接又有前馈连接，这使得RNN可以更加容易处理不分段的文本等。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "什么是Group Convolution", // 问题的标题
        "refer_answer": "若卷积神将网络的上一层有N个卷积核,则对应的通道数也为N。设群数目为M,在进行卷积操作的时候,将通道分成M份,每个group对应N/M个通道,然后每个group卷积完成后输出叠在一起,作为当前层的输出通道。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": " 训练过程中,若一个模型不收敛,那么是否说明这个模型无效?导致模型不收敛的原因有哪些? ", // 问题的标题
        "refer_answer": "并不能说明这个模型无效,导致模型不收敛的原因可能有数据分类的标注不准确,样本的信息量太大导致模型不足以fit整个样本空间。学习率设置的太大容易产生震荡,太小会导致不收敛。可能复杂的分类任务用了简单的模型。数据没有进行归一化的操作。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "图像处理中锐化和平滑的操作", // 问题的标题
        "refer_answer": "锐化就是通过增强高频分量来减少图像中的模糊,在增强图像边缘的同时也增加了图像的噪声。\n平滑与锐化相反,过滤掉高频分量,减少图像的噪声是图片变得模糊。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "VGG使用3*3卷积核的优势是什么?", // 问题的标题
        "refer_answer": "2个3*3的卷积核串联和5*5的卷积核有相同的感知野,前者拥有更少的参数。多个3*3的卷积核比一个较大尺寸的卷积核有更多层的非线性函数,增加了非线性表达,使判决函数更具有判决性。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "请解释一下什么叫梯度消失", // 问题的标题
        "refer_answer": "在神经网络中，当前面隐藏层的学习速率低于后面隐藏层的学习速率，即随着隐藏层数目的增加，分类准确率反而下降了。这种现象叫做消失的梯度问题。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "用过哪些移动端深度学习框架？", // 问题的标题
        "refer_answer": "开源的有：小米的MACE，骁龙的SNPE，腾讯的FeatherCNN和ncnn，百度的mobile-deep-learning(MDL)；caffe、tensorflow lite都有移动端，只是可能没有上面的框架效率高。据传还有支付宝的xNN，商汤的PPL，不过都是自用，未开源。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "BN层的作用，为什么要在后面加伽马和贝塔，不加可以吗", // 问题的标题
        "refer_answer": "BN层的作用是把一个batch内的所有数据，从不规范的分布拉到正态分布。这样做的好处是使得数据能够分布在激活函数的敏感区域，敏感区域即为梯度较大的区域，因此在反向传播的时候能够较快反馈误差传播。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "RNN梯度消失问题,为什么LSTM和GRU可以解决此问题？",
        "refer_answer": "RNN由于网络较深,后面层的输出误差很难影响到前面层的计算,RNN的某一单元主要受它附近单元的影响。而LSTM因为可以通过阀门记忆一些长期的信息,相应的也就保留了更多的梯度。而GRU也可通过重置和更新两个阀门保留长期的记忆,也相对解决了梯度消失的问题。",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第12套面试题
    "industry": "机器学习", // 行业
    "count": 10, // 题目数量
    "title": "机器学习面试精选试题（一）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "请阐述一下1*1的卷积作用", // 问题的标题
        "refer_answer": "实现跨通道的交互和信息整合,实现卷积核通道数的降维和升维,可以实现多个feature map的线性组合,而且可是实现与全连接层的等价效果。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "请说明激活函数的作用", // 问题的标题
        "refer_answer": "激活函数是用来加入非线性因素的,提高神经网络对模型的表达能力,解决线性模型所不能解决的问题。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "讲一下基于WFST的静态解码网络的语音识别流程？ ", // 问题的标题
        "refer_answer": "从语音特征开始讲起，我讲了MFCC和LPC的原理以及提取过程，这一部分讲的很细，然后讲了viterbi解码过程，最后概述了一下HCLG.fst构建流程。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "请简单说一下CNN为什么比DNN在图像识别上更好", // 问题的标题
        "refer_answer": "DNN的输入是向量形式，并未考虑到平面的结构信息，在图像和NLP领域这一结构信息尤为重要，例如识别图像中的数字，同一数字与所在位置无关（换句话说任一位置的权重都应相同），CNN的输入可以是tensor，例如二维矩阵，通过filter获得局部特征，较好的保留了平面结构信息。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "请简单介绍一下GAN网络的思想", // 问题的标题
        "refer_answer": "GAN用一个生成模型和一个判别模型,判别模型用于判断给定的图片是不是真实的图片,生成模型自己生成一张图片和想要的图片很像,开始时两个模型都没有训练,然后两个模型一起进行对抗训练,生成模型产生图片去欺骗判别模型,判别模型去判别真假,最终两个模型在训练过程中,能力越来越强最终达到稳态。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "为什么用relu就不用sigmoid了", // 问题的标题
        "refer_answer": "Sigmoid的导数只有在0的附近时有比较好的激活性,在正负饱和区域的梯度都接近0，会导致梯度弥散。而relu函数在大于0的部分梯度为常数,不会产生梯度弥散现象。Relu函数在负半区导数为0,也就是说这个神经元不会经历训练,就是所谓稀疏性。而且relu函数的导数计算的更快。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "防止过拟合有哪些方法", // 问题的标题
        "refer_answer": "1）Dropout ；\n2）加L1/L2正则化；\n3）BatchNormalization ；\n4）网络bagging", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "请阐述一下中缀表达式转后缀表达式", // 问题的标题
        "refer_answer": "对于中缀表达式,遇到操作数直接将其输出,如果遇到操作符和左括号全部压入栈中,若遇到右括号则将栈中元素全部弹出,直到遇到左括号为止。压栈过程中,若遇到其它操作符,从栈中弹出元素直到遇到更低优先级的操作符为止。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "请介绍一下大顶堆怎么插入和删除",
        "refer_answer": "插入:在一个大顶堆之后插入新的元素可能会破坏堆的结构,此时需要找到新插入节点的父节点,对堆进行自下而上的调整使其变成一个大顶堆。\n删除:将堆的最后一个元素填充到删除元素的位置,然后调整堆结构构造出新的大顶堆。",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第13套面试题
    "industry": "前端", // 行业
    "count": 10, // 题目数量
    "title": "前端面试精选试题（二）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "为什么fetch发送post请求的时候，总是发送2次，第一次状态码是204，第二次才成功？", // 问题的标题
        "refer_answer": "原因很简单，因为你用fetch的post请求的时候，导致fetch 第一次发送了一个Options请求，询问服务器是否支持修改的请求头，如果服务器支持，则在第二次中发送真正的请求。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "请说一下你对HTML语义化标签的理解", // 问题的标题
        "refer_answer": "HTML5语义化标签是指正确的标签包含了正确的内容，结构良好，便于阅读，比如nav表示导航条，类似的还有article、header、footer等等标签。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "请介绍一下Doctype作用?严格模式与混杂模式如何区分？它们有何意义? ", // 问题的标题
        "refer_answer": "Doctype声明于文档最前面，告诉浏览器以何种方式来渲染页面，这里有两种模式，严格模式和混杂模式。\n严格模式的排版和JS 运作模式是 以该浏览器支持的最高标准运行。\n混杂模式，向后兼容，模拟老式浏览器，防止浏览器无法兼容页面。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "Cookie和session的区别", // 问题的标题
        "refer_answer": "HTTP是一个无状态协议，因此Cookie的最大的作用就是存储sessionId用来唯一标识用户.", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "怎么看网站的性能如何?", // 问题的标题
        "refer_answer": "检测页面加载时间一般有两种方式，一种是被动去测：就是在被检测的页面置入脚本或探针，当用户访问网页时，探针自动采集数据并传回数据库进行分析，另一种主动监测的方式，即主动的搭建分布式受控环境，模拟用户发起页面访问请求，主动采集性能数据并分析，在检测的精准度上，专业的第三方工具效果更佳，比如说性能极客.", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "知道304吗，什么时候用304？", // 问题的标题
        "refer_answer": "304：如果客户端发送了一个带条件的GET 请求且该请求已被允许，而文档的内容（自上次访问以来或者根据请求的条件）并没有改变，则服务器应当返回这个304状态码。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": " transition和animation的区别", // 问题的标题
        "refer_answer": "Animation和transition大部分属性是相同的，他们都是随时间改变元素的属性值，他们的主要区别是transition需要触发一个事件才能改变属性，而animation不需要触发任何事件的情况下才会随时间改变属性值，并且transition为2帧，从from .... to，而animation可以一帧一帧的。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "请介绍一下闭包", // 问题的标题
        "refer_answer": "一句话可以概括：闭包就是能够读取其他函数内部变量的函数，或者子函数在外调用，子函数所在的父函数的作用域不会被释放。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "请说明跨域的原理",
        "refer_answer": "跨域，是指浏览器不能执行其他网站的脚本。它是由浏览器的同源策略造成的，是浏览器对JavaScript实施的安全限制，那么只要协议、域名、端口有任何一个不同，都被当作是不同的域。跨域原理，即是通过各种方式，避开浏览器的安全限制。",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第14套面试题
    "industry": "前端", // 行业
    "count": 10, // 题目数量
    "title": "前端面试精选试题（一）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "请说一下你所理解的dom是什么？", // 问题的标题
        "refer_answer": "文档对象模型（Document Object Model，简称DOM），是W3C组织推荐的处理可扩展标志语言的标准编程接口。在网页上，组织页面（或文档）的对象被组织在一个树形结构中，用来表示文档中对象的标准模型就称为DOM。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "关于dom的api有什么", // 问题的标题
        "refer_answer": "节点创建型api，页面修改型API，节点查询型API，节点关系型api，元素属性型api，元素样式型api等。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "说一下Fetch和Ajax比有什么优缺点？ ", // 问题的标题
        "refer_answer": "promise方便异步，在不想用jQuery的情况下，相比原生的ajax，也比较好写。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "知道PWA吗", // 问题的标题
        "refer_answer": "PWA全称Progressive Web App，即渐进式WEB应用。一个 PWA 应用首先是一个网页, 可以通过 Web 技术编写出一个网页应用. 随后添加上 App Manifest 和 Service Worker 来实现 PWA 的安装和离线等功能。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "请说一下redux用处", // 问题的标题
        "refer_answer": "在组件化的应用中，会有着大量的组件层级关系，深嵌套的组件与浅层父组件进行数据交互，变得十分繁琐困难。而redux，站在一个服务级别的角度，可以毫无阻碍地将应用的状态传递到每一个层级的组件中。redux就相当于整个应用的管家。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "阐述一下vue双向绑定原理", // 问题的标题
        "refer_answer": "vue数据双向绑定是通过数据劫持结合发布者-订阅者模式的方式来实现的。利用了 Object.defineProperty() 这个方法重新定义了对象获取属性值(get)和设置属性值(set)。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "请说一下操作系统进程和线程的区别", // 问题的标题
        "refer_answer": "进程，是并发执行的程序在执行过程中分配和管理资源的基本单位，是一个动态概念，竞争计算机系统资源的基本单位。\n 线程，是进程的一部分，一个没有线程的进程可以被看作是单线程的。线程有时又被称为轻权进程或轻量级进程，也是 CPU 调度的一个基本单位。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "作为前端开发，如果遇到资源无法加载，会是什么问题，如何解决?", // 问题的标题
        "refer_answer": "我遇到这种网页打不开的情况下首先会打开开发者工具看报错情况，根据http状态码来确认是服务器还是客户端的错误，然后再具体问题来分析。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "请说一下尾递归是什么",
        "refer_answer": "如果一个函数中所有递归形式的调用都出现在函数的末尾，我们称这个递归函数是尾递归的。当递归调用是整个函数体中最后执行的语句且它的返回值不属于表达式的一部分时，这个递归调用就是尾递归。",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第15套面试题
    "industry": "测试工程师", // 行业
    "count": 10, // 题目数量
    "title": "测试工程师面试精选试题", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "请你介绍一下单元测试", // 问题的标题
        "refer_answer": "单元测试：完成最小的软件设计单元（模块）的验证工作，目标是确保模块被正确的编码，使用过程设计描述作为指南，对重要的控制路径进行测试以发现模块内的错误，通常情况下是白盒的，对代码风格和规则、程序设计和结构、业务逻辑等进行静态测试，及早的发现和解决不易显现的错误。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "请分别介绍一下系统测试和验收测试。", // 问题的标题
        "refer_answer": "1、系统测试：是基于系统整体需求说明书的黑盒类测试，应覆盖系统所有联合的部件。系统测试是针对整个产品系统进行的测试，目的是验证系统是否满足了需求规格的定义，找出与需求规格不相符合或与之矛盾的地方。系统测试的对象不仅仅包括需要测试的产品系统的软件，还要包含软件所依赖的硬件、外设甚至包括某些数据、某些支持软件及其接口等。因此，必须将系统中的软件与各种依赖的资源结合起来，在系统实际运行环境下来进行测试。\n2、验收测试：验收测试是指系统开发生命周期方法论的一个阶段，这时相关的用户或独立测试人员根据测试计划和结果对系统进行测试和接收。它让系统用户决定是否接收系统。它是一项确定产品是否能够满足合同或用户所规定需求的测试。验收测试包括Alpha测试和Beta测试。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "你觉得单元测试可行吗？ ", // 问题的标题
        "refer_answer": "可行，单元测试可以有效地测试某个程序模块的行为，是未来重构代码的信心保证。事前可以保证质量，事后可以快速复现问题，并在修改代码后做回归自测。可行性考虑的是要用一些可行的方法做到关键的代码可测试，如通过边界条件、等价类划分、错误、因果，设计测试用例要覆盖常用的输入组合、边界条件和异常。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "请问你有用过什么测试工具吗，用过哪些？", // 问题的标题
        "refer_answer": "自动化测试工具用过selenium和appium；性能测试工具有用过Jmeter", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "在做测试的过程中，假如前端和后端吵起来了都在踢皮球觉得对方该改代码，你怎么办？", // 问题的标题
        "refer_answer": "此时就应该找技术领导或leader们基于安全性、性能、可测试性、可维护性讨论敲定一个解决方案，做到开发环境方便开发，线上环境少配置", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "请问设计模式是什么？", // 问题的标题
        "refer_answer": "设计模式（Design pattern）代表了最佳的实践，通常被有经验的面向对象的软件开发人员所采用。设计模式是软件开发人员在软件开发过程中面临的一般问题的解决方案。这些解决方案是众多软件开发人员经过相当长的一段时间的试验和错误总结出来的。设计模式是一套被反复使用的、多数人知晓的、经过分类编目的、代码设计经验的总结。使用设计模式是为了重用代码、让代码更容易被他人理解、保证代码可靠性。毫无疑问，设计模式于己于他人于系统都是多赢的，设计模式使代码编制真正工程化，设计模式是软件工程的基石，如同大厦的一块块砖石一样。项目中合理地运用设计模式可以完美地解决很多问题，每种模式在现实中都有相应的原理来与之对应，每种模式都描述了一个在我们周围不断重复发生的问题，以及该问题的核心解决方案，这也是设计模式能被广泛应用的原因。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "上亿数量的链接，如何找出点击量排名前十的链接？", // 问题的标题
        "refer_answer": "分两种情况：可一次读入内存，不可一次读入。\n思路：trie树+堆，数据库索引，划分子集分别统计，hash，分布式计算，近似统计，外排序。\n遍历文件，对每个url求取hash(url)%1000，然后根据所取得的值将url分别存储到1000个小文件（记为a0,a1,...,a999）中。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "请你说一下分布式和集群的概念。", // 问题的标题
        "refer_answer": "分布式：是指将不同的业务分布在不同的地方，\n集群：是指将几台服务器集中在一起，实现同一业务。\n分布式中的每一个节点，都可以做集群，而集群并不一定就是分布式的。集群有组织性，一台服务器垮了，其它的服务器可以顶上来，而分布式的每一个节点，都完成不同的业务，一个节点垮了，哪这个业务就不可访问了。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "假设晚上有四个人过桥，一次只能过两个人，但是只有一只手电筒，四个人过桥时间分别是1，2，5，8，求最短过桥时间",
        "refer_answer": "假设这四人依次是甲乙丙丁：首先甲和乙过桥,甲带手电筒回来；然后丙和丁过桥,由乙带手电筒回来；最后甲再和乙一起过桥.所以最少用时间是2+1+8+2+2=15（分钟）",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第16套面试题
    "industry": "运营", // 行业
    "count": 10, // 题目数量
    "title": "运营面试精选试题（一）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "你来说说，运营和产品有什么区别？", // 问题的标题
        "refer_answer": "产品是实现o-1，运营是实现1-100。从某种角度上说，产品和运营是不分家的。产品想的是如何生个健康的孩子，运营想的是如何把这个孩子养的好好的，而运营最好就是在孩子刚开始的时候就介入进来，毕竟很多时候孩子在一开始就需要好好对待。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "除QQ、微信、微博、陌陌外，请你列出尽可能多的社交类APP，并每个用一句话介绍下它们的核心特点。", // 问题的标题
        "refer_answer": "1.小红书：年轻人的生活方式平台---和偶像做邻居，get 潮流生活方式、热门话题，和全世界好看有趣的年轻人一起标记吃穿玩乐买的生活日常。\n2.多闪：专为亲密好友准备的小视频互动APP，闪电记录，随拍生活中的精彩瞬间，多款特效贴纸，让视频拍摄更有创意。\n3.探探：一款恋爱交友APP---打开全新的相遇方式，以双向的“一见钟情”找到合拍的人。\n4.Soul：通过完成30秒的“灵魂测试”，来找到心灵相通的小伙伴，匿名树洞写最真实的博客。\n5.吱呀：以声音为一段关系的起始点，隐匿身份、外貌等现实条件的限制，开启纯粹的声音交友之旅。\n6.知乎：聚集了各行各业的专家达人，用专业的知识、经验和见解让每个人高效获得可信赖的解答。\n7.百度贴吧：以兴趣主题聚合志同道合者的互动平台。\n8.豆瓣：快速找到你喜欢的电影、剧集、综艺、图书和音乐，随时随地记录你的生活与想法，帮助你与兴趣相投的人找到彼此，建立自己的书影音世界、丰富你的个人精神生活。\n9.YY：全民娱乐互动直播平台---各种品类精彩直播随时看，打发你的无聊时间，随时随地玩到嗨。\n10.脉脉：专为职场人打造的职业认证实名社交，帮助职场人更方便高效地在线上拓展人脉、交流合作、求职招聘，能极大地提升工作效率和增加职业机遇。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "你来说一下，开一家奶茶店需要考虑的三个要素是什么。 ", // 问题的标题
        "refer_answer": "1、选址：选址要考虑人流量，目标人群，竞争强度等要素。由于外卖的普及，靠近写字楼可能会带来很多的线上流量。\n2、选品：目前市面上奶茶店很多，各种类型都有，竞争很激烈，选择一款质量过硬，口味受欢迎，有识别度的产品就变得很重要了。\n3、营销：由于竞争激烈，奶茶店都想方设法让用户记住，营销就变得很重要了，成为“网红奶茶”才能从激烈的竞争中脱颖而出。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "如果要以互联网思维开一个火锅店，请你来谈谈你的想法吧。", // 问题的标题
        "refer_answer": "前期宣传：开设微信公众号，制作宣传推文；与当地一些自媒体或KOL开展商务合作，在朋友圈、抖音、小红书等平台开展宣传。\n入店体验：在线扫码点单；开设外卖服务；开展团购活动。\n后期维护：从店铺装修、菜品卖相、味道等方面，引导顾客发朋友圈、写小红书、拍抖音（分享有优惠或送饮料零食等）。\n客户管理：设置电子会员卡，在线积分。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "请你用三句话给一个8岁的小孩描述一下京东", // 问题的标题
        "refer_answer": "京东是一个在网上购物的软件；你可以在手机电脑上选购商品，在网上付钱；网站负责送到你填好的地址。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "来说一下，你是如何看待抖音的迅速崛起的？", // 问题的标题
        "refer_answer": "1 2018年是抖音的爆炸增长之年。抖音在短视频赛道迅猛发展，2018年7月，抖音首次公布其全球月活跃用户数突破5亿，国内超3亿，成为有史以来最成功的出海产品之一。这不但给视频类行业带来强烈的危机感，同时威胁争夺用户在线时长的社交产品行业。\n2抖音使用与今日头条一脉相承的算法分发机制，精准抓取用户喜好，通过超出同类产品水平的滤镜美颜功能提升视频的精细度，以多元化的视频内容提高用户使用时长。同时抖音的中心化内容分发机制，确保普通用户始终创造爆款的机会，保障优质内容的传播优先性。因此在短短一年左右时间，抖音平台涌现出无数优秀的代表性IP，从最初的舞蹈类短视频平台成功转型成“记录美好生活”的趣味乐活平台。\n3抖音逐渐地也在主动吸纳PGC、红人和MCN，共建内容生态，也探索商业路径。星图平台的上线、购物车功能的开放、直播功能的推广，都在预示2019年即将到来的流量二次爆发。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "请说一下，有了淘宝之后，天猫app存在的意义是什么？", // 问题的标题
        "refer_answer": "1实现阿里在C2C及B2C的双布局 淘宝是网购零售平台，是C2C的个人网上交易平台，产品来源多为批发或代理。天猫是线上综合购物平台，拥有20+w知名品牌，是在线B2C购物平台，是品牌的集合销售商城。 淘宝店是任何人都可以开，而天猫商城是需要公司进行注册。而且开淘宝店，不需要缴纳什么，随便一个人就可以开；而入驻天猫至少需要缴纳几万的保证金（当然淘宝店也可以自愿加入消费者保障，缴纳保证金）。其次，天猫的商家必须缴纳年费，淘宝店则没有此费用，除缴纳保证金加入消保之外也就是推广的费用。\n2满足高端用户的消费需求 淘宝商品不受限制，天猫是自由品牌或者是品牌授权，也就说天猫的商品大部分都是有独立品牌的产品。而且天猫的商品都有七天退换货保障，而淘宝在2015年新消保法出来后，已经让商家默认加入。保障不一样，天猫比淘宝更有保障。 以上决定天猫的目标用户相对来说消费能力更强一些，天猫的价格一般来说都会比淘宝更贵一些。天猫是完全的B2C，即天猫是商家向消费者出售产品，就相当于我们在购物中心中的店铺中购货，用户看的是品牌和品牌背后的价值，追求高质量和高生活品质。\n3天猫更具有品牌运营的价值 天猫很注重对于品牌价值的管理。淘宝上有一些用户会因为差评与商家产生纠纷，而天猫则会无条件的服务消费者。天猫的slogan是“理想生活”，实现品牌运营的转型，每个月会发布包括天猫品牌力榜单，天猫趋势榜单等消费榜单。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "你来说一下，目前互联网行业的盈利模式有哪些，并谈谈对不同盈利模式的理解。", // 问题的标题
        "refer_answer": "1内置商城：销售虚拟道具等，与传统的游戏盈利模式类似。\n2 App store付费下载：刷榜竞争严重，一般配合限时免费做推广。另外，由于国内用户付费习惯差，做国外的优势要大很多。\n3增值业务：与一些SP渠道合作，扣手机费分成。\n4移动广告：以Banner为主，插屏、全屏、视频和富媒体等形式也有，开发者易受到各移动广告平台的剪刀差价和运营影响，包括扣量、数据核实不标准、Ecpm低等。\n5应用墙和积分墙：无积分和有积分模式，CPA计费。\n另有交叉补贴、三方市场、开源捐赠、上市收购等“免费”盈利模式。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "请你来说出 三个你自己或身边朋友常用的导购类APP，并说说他们的优缺点。注意，手机淘宝、手机天猫除外。",
        "refer_answer": "贝贝网，做母婴产品的，母婴品牌最注重的就是实体感觉，婴儿皮肤不能过度刺激，所以线上不好销售.\n当当网 ，主营书籍类业务，书籍质量，正品有保障，大部分都是出版社直接供应，但是价格方面过高.\n蘑菇街，主营年轻女装，女装品牌较为时尚和年轻化，和淘宝天猫同质化严重",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第17套面试题
    "industry": "运营", // 行业
    "count": 10, // 题目数量
    "title": "运营面试精选试题（二）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "你来说一下百度百科 和 知乎 的区别", // 问题的标题
        "refer_answer": "1产品定位维度:百度百科是提供资讯的工具型产品。百度百科是百度为丰富其知识搜索体系所搭建的产品线之一，本质上是为百度搜索体系服务的，所以百度百科不能算是一个纯粹的流量知识平台。而知乎是一个由用户生产内容的社区产品。\n2信息源维度:百度百科的信息源是权威渠道，本身不生产不可考据的内容，属于PGC或PUGC。而知乎的内容是由用户自发生产的，属于UGC，知乎的社区共治原则是每个用户都会认真回答其他用户的提问，从而形成良好的社区氛围。\n3生产内容的调性维度:百度百科提供“事实”。而知乎产生“观点”。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "什么是运营呢，谈谈你对运营的认识。", // 问题的标题
        "refer_answer": "简单来说运营包括了拉新，留存，促活。我对运营的认识：运营就是为了让更多的用户知道你的产品，了解你的产品，喜欢用你的产品，同时实现变现或配合产品和技术等其他部门等达到变现的目的。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "你觉得什么是成功的运营？可以结合具体实例说明。 ", // 问题的标题
        "refer_answer": "达到两个目的：1 尽可能延长产品生命周期；2 促进产品内用户的参与程度。好的运营连接了企业/产品与用户，使用户感受到企业/产品的存在，且留下正面、活跃、专业等印象，赢得用户的口碑。\n小米 米粉 ，提出了参与感一词，版本迭代过程中会邀请部分核心用户参与讨论和开发，雷军本人也擅长与用户互动、拉近距离；\n 华为 花粉，在各大知名高校成立了华为花粉俱乐部，策划各种活动，提高品牌在大学生群体中的知名度和好感度；", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "谈谈你对用户运营的理解吧。", // 问题的标题
        "refer_answer": "用户运营主要是以用户为核心，通过用户画像对各用户进行分类、搭建合理的用户体系，从而对各类 用户进行针对性地进行管理，提高老用户的活跃度、吸引新用户参与，最终实现提高用户粘性，最大化的提高转化率的过程。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "你觉得优酷网的综艺频道怎么运营算是成功呢？", // 问题的标题
        "refer_answer": "1首先，要抓住“泛文化”这个市场新增量，不断拓展内容视角，满足用户“千人千面”的需求。真人秀、脱口秀、轻综艺、真人秀+脱口秀、甚至是纪录片等综艺类型节目都可以成为“泛文化”的表达形式，在综艺的定义上摆脱束缚，采用用户偏好的方式去创作节目，进一步驱动市场对综艺节目的细分和孵化，发掘新的内容品类。\n2其次，稳固在圈层文化领域的定位，垂直内容继续深耕细作，发力圈层爆款，强化“这就是”等系列的品牌效应，抢占用户心智。\n3最后，通过综艺IP续存、产业链转化、跨界营销等进行流量变现，比如可以让一些优质的综艺IP跳出所在圈层，活跃至生活各个领域，同款周边进行开发并在淘宝天猫、优酷漫画等上线。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "根据你的经验，怎么样去判断一个付费内容是否是有效的运营推广？", // 问题的标题
        "refer_answer": "第一步：产品用户分析。谁是付费客户？\n第二步：运营渠道分析。产品传递到客户/用户的渠道有哪些？\n第三步：运营渠道评估。每条渠道的阻力是什么？每条渠道的损耗怎样？\n明晰这三步后，分别对每步进行埋点数据分析，观察每周数据对比，看是否有变化。若好指标数据变高，说明有效，反之则反。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "电商平台的用户反映第三方店铺的发货时间太久，如果你是电商平台的运营者，你要怎么解决这个问题？", // 问题的标题
        "refer_answer": "1.介入调查是否存在发货太久的情况。\n2.若发货时间未超出平台规定时间，则催一下商家快点发货，并耐心安抚用户的情绪。\n3.若发货时间超出平台规定时间，则给予用户退款操作并对商家违期未发货的行为进行罚款处理。 ", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "请你说一说电商平台在用户不主动填写的情况下，要怎么才能怎么获取用户数据，比如用户的身高、体重、尺码。", // 问题的标题
        "refer_answer": "1.做性格等其他小测试，通过微信分享，这样就能获取微信好友以及测试人自身的信息；\n2.通过一些活动获取信息，比如花呗的线下支付等等活动；\n3.根据电商平台用户的商品历史浏览记录，然后经过用户画像分析系统来推断出用户的信息，例如性别、身高、体重等等；\n4.数据埋点，在关键按钮处技术埋点，追踪用户行为。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "有一个新的用户原创内容网站，假设你是运营，如何去获取前 1000 名用户？",
        "refer_answer": "最有效果的话就是找kol，通过kol去传播;当然，传播需要一个介质和一个内容，既然是用户原创内容网站，可以先邀请kol来写相关的内容。\n具体方案思路如下：\n1、计算成本\n2、根据成本去计算对应的kol数量和扩充的内容种类，做出相应规划\n3、策划拉新活动，结合网站类型，给出相关的福利，比如是旅行网站，可以给出xxx双人游，分享出去让多少人点击或助力即可解锁xxx福利",
        "note": "",
        "analyse": ""
      }
    ]
  }, 
  { // 第18套面试题
    "industry": "算法工程师", // 行业
    "count": 10, // 题目数量
    "title": "算法工程师面试精选试题（二）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "循环神经网络，为什么好?", // 问题的标题
        "refer_answer": "循环神经网络模型（RNN）是一种节点定向连接成环的人工神经网络，是一种反馈神经网络，RNN利用内部的记忆来处理任意时序的输入序列，并且在其处理单元之间既有内部的反馈连接又有前馈连接，这使得RNN可以更加容易处理不分段的文本等。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "什么是Group Convolution", // 问题的标题
        "refer_answer": "若卷积神将网络的上一层有N个卷积核,则对应的通道数也为N。设群数目为M,在进行卷积操作的时候,将通道分成M份,每个group对应N/M个通道,然后每个group卷积完成后输出叠在一起,作为当前层的输出通道。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": " 训练过程中,若一个模型不收敛,那么是否说明这个模型无效?导致模型不收敛的原因有哪些? ", // 问题的标题
        "refer_answer": "并不能说明这个模型无效,导致模型不收敛的原因可能有数据分类的标注不准确,样本的信息量太大导致模型不足以fit整个样本空间。学习率设置的太大容易产生震荡,太小会导致不收敛。可能复杂的分类任务用了简单的模型。数据没有进行归一化的操作。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "图像处理中锐化和平滑的操作", // 问题的标题
        "refer_answer": "锐化就是通过增强高频分量来减少图像中的模糊,在增强图像边缘的同时也增加了图像的噪声。\n平滑与锐化相反,过滤掉高频分量,减少图像的噪声是图片变得模糊。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "VGG使用3*3卷积核的优势是什么?", // 问题的标题
        "refer_answer": "2个3*3的卷积核串联和5*5的卷积核有相同的感知野,前者拥有更少的参数。多个3*3的卷积核比一个较大尺寸的卷积核有更多层的非线性函数,增加了非线性表达,使判决函数更具有判决性。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "请解释一下什么叫梯度消失", // 问题的标题
        "refer_answer": "在神经网络中，当前面隐藏层的学习速率低于后面隐藏层的学习速率，即随着隐藏层数目的增加，分类准确率反而下降了。这种现象叫做消失的梯度问题。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "用过哪些移动端深度学习框架？", // 问题的标题
        "refer_answer": "开源的有：小米的MACE，骁龙的SNPE，腾讯的FeatherCNN和ncnn，百度的mobile-deep-learning(MDL)；caffe、tensorflow lite都有移动端，只是可能没有上面的框架效率高。据传还有支付宝的xNN，商汤的PPL，不过都是自用，未开源。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "BN层的作用，为什么要在后面加伽马和贝塔，不加可以吗", // 问题的标题
        "refer_answer": "BN层的作用是把一个batch内的所有数据，从不规范的分布拉到正态分布。这样做的好处是使得数据能够分布在激活函数的敏感区域，敏感区域即为梯度较大的区域，因此在反向传播的时候能够较快反馈误差传播。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "RNN梯度消失问题,为什么LSTM和GRU可以解决此问题？",
        "refer_answer": "RNN由于网络较深,后面层的输出误差很难影响到前面层的计算,RNN的某一单元主要受它附近单元的影响。而LSTM因为可以通过阀门记忆一些长期的信息,相应的也就保留了更多的梯度。而GRU也可通过重置和更新两个阀门保留长期的记忆,也相对解决了梯度消失的问题。",
        "note": "",
        "analyse": ""
      }
    ]
  },
  { // 第19套面试题
    "industry": "算法工程师", // 行业
    "count": 10, // 题目数量
    "title": "算法工程师面试精选试题（一）", // 题库标题
    "tip": "", // 题库提示
    "questions": [ // 问题序列
      { // 第一道题
        "title": "请用一分钟的时间介绍一下自己", 
        "refer_answer": "自我介绍的注意事项：1.千万不要背诵简历：被要求进行自我介绍的时候面试官会在把你的简历捋一遍，切忌把自我介绍变成背诵简历！不要简单的复述简历，请讲出简历中的亮点！\n2.要通过自我介绍有意引导之后面试问题的方向：整场面试就像是与面试官对弈的过程，而自我介绍就是面试者排兵布阵的最好工具！你所说的内容会决定了HR接下来问题的走向，所以自我介绍时请对你履历中的亮点点到为止，引诱HR在后面的问题中挖掘出你的亮点。\n3.注意把握时间:自我介绍时间也是面试官阅览你简历的时间，在一些面试中面试官会直接说请在X分钟内做一个自我介绍，一般来说这个时间并不是很严格的，不过你的自我介绍时间尽量控制在X分钟左右。\n4.提前做好面试预演:有了自我介绍稿件后请对着镜子自己多多练习，但是不要刻板的背诵稿件，确保自己整个过程中放放松自然，记住什么样的你才是最让人赏心悦目的。做好充足的准备，才能在整场面试中保持信心，一步一步引导着HR跟着你的节奏走，将面试的主动权完全掌握在自己手中。", 
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第二道题
        "title": "请阐述一下1*1的卷积作用", // 问题的标题
        "refer_answer": "实现跨通道的交互和信息整合,实现卷积核通道数的降维和升维,可以实现多个feature map的线性组合,而且可是实现与全连接层的等价效果。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第三道题
        "title": "请说明激活函数的作用", // 问题的标题
        "refer_answer": "激活函数是用来加入非线性因素的,提高神经网络对模型的表达能力,解决线性模型所不能解决的问题。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第四道题
        "title": "讲一下基于WFST的静态解码网络的语音识别流程？ ", // 问题的标题
        "refer_answer": "从语音特征开始讲起，我讲了MFCC和LPC的原理以及提取过程，这一部分讲的很细，然后讲了viterbi解码过程，最后概述了一下HCLG.fst构建流程。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第五道题
        "title": "请简单说一下CNN为什么比DNN在图像识别上更好", // 问题的标题
        "refer_answer": "DNN的输入是向量形式，并未考虑到平面的结构信息，在图像和NLP领域这一结构信息尤为重要，例如识别图像中的数字，同一数字与所在位置无关（换句话说任一位置的权重都应相同），CNN的输入可以是tensor，例如二维矩阵，通过filter获得局部特征，较好的保留了平面结构信息。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第六道题
        "title": "请简单介绍一下GAN网络的思想", // 问题的标题
        "refer_answer": "GAN用一个生成模型和一个判别模型,判别模型用于判断给定的图片是不是真实的图片,生成模型自己生成一张图片和想要的图片很像,开始时两个模型都没有训练,然后两个模型一起进行对抗训练,生成模型产生图片去欺骗判别模型,判别模型去判别真假,最终两个模型在训练过程中,能力越来越强最终达到稳态。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第七道题
        "title": "为什么用relu就不用sigmoid了", // 问题的标题
        "refer_answer": "Sigmoid的导数只有在0的附近时有比较好的激活性,在正负饱和区域的梯度都接近0，会导致梯度弥散。而relu函数在大于0的部分梯度为常数,不会产生梯度弥散现象。Relu函数在负半区导数为0,也就是说这个神经元不会经历训练,就是所谓稀疏性。而且relu函数的导数计算的更快。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第八道题
        "title": "防止过拟合有哪些方法", // 问题的标题
        "refer_answer": "1）Dropout ；\n2）加L1/L2正则化；\n3）BatchNormalization ；\n4）网络bagging", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第九道题
        "title": "请阐述一下中缀表达式转后缀表达式", // 问题的标题
        "refer_answer": "对于中缀表达式,遇到操作数直接将其输出,如果遇到操作符和左括号全部压入栈中,若遇到右括号则将栈中元素全部弹出,直到遇到左括号为止。压栈过程中,若遇到其它操作符,从栈中弹出元素直到遇到更低优先级的操作符为止。", // 问题的参考答案
        "note": "", // 备注
        "analyse": "" // 解析
      },
      { // 第十道题
        "title": "请介绍一下大顶堆怎么插入和删除",
        "refer_answer": "插入:在一个大顶堆之后插入新的元素可能会破坏堆的结构,此时需要找到新插入节点的父节点,对堆进行自下而上的调整使其变成一个大顶堆。\n删除:将堆的最后一个元素填充到删除元素的位置,然后调整堆结构构造出新的大顶堆。",
        "note": "",
        "analyse": ""
      }
    ]
  }
]