export let detailBanks = [
  {
  "parentId": 1,
  "industry": "外企",
  "class": "面试题",
  "title": "摸透“四大”样板题",
  "tips": "这是这个题库的总提示",
  "questions": [{
      "id": 1,
      "title": "手机厂由于设计失误，有可能造成电池寿命比原设计的寿命短一半，速请你制定出解决方案。",
      "refer_answer": "解决方案可以是免费更换电池或给50元购买厂家新手机的折换券。并给所有已经购买此款手机的用户写信。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 2,
      "title": "请用一笔画出4根直线，将图上9个点全部联结。",
      "refer_answer": "画一根与水平成45度角的斜线到某一点，然后以此点作为直角三角形两个直角边的交点，向任何一边作直角三角形，就可以把9个点联结起来。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 3,
      "title": "为什么你想到这里来工作?",
      "refer_answer": "(这应该是你喜爱的题目。)因为你在此前进行了大量的准备，你了解这家公司。组织几个原因，最好是简短而切合实际的。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 4,
      "title": "这个职位最吸引你的是什么?",
      "refer_answer": "(这是一个表现你对这个公司、这份工作看法的机会。)回答应使考官确认你具备他要求的素质。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 5,
      "title": "谁曾经给你最大的影响?",
      "refer_answer": "选一个名字即可，最好是你过去的老师等，再简短准备几句说明为什么。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 6,
      "title": "你是否愿意去公司派你去的那个地方?",
      "refer_answer": "如果你回答“NO”，你可能会因此而失掉这份工作，记住：你被雇用后你可以和公司就这个问题进行谈判。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 7,
      "title": "你将在这家公司呆多久?",
      "refer_answer": "回答这样的问题，你该持有一种明确的态度，即：能待多久待多久，尽可能长，“我在这里继续学习和完善自己。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 8,
      "title": "什么是你最大的成就?",
      "refer_answer": "准备一两个成功的小故事。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 9,
      "title": "你能提供一些参考证明吗?",
      "refer_answer": "你该准备好一些相关的整洁的打印件，并有现在的电话和地址。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 10,
      "title": "从现在开始算，未来的5年，你想自己成为什么样子?或者：告诉我，你事业的目标。",
      "refer_answer": "回答一定要得体，根据你的能力和经历。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 11,
      "title": "你有和这份工作相关的训练或品质吗?",
      "refer_answer": "说明要短，举两三个最重要的品质，要有事实依据。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 12,
      "title": "导致你成功的因素是什么?",
      "refer_answer": "回答要短，让考官自己去探究，比如只一句话：“我喜欢挑战性工作。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 13,
      "title": "你最低的薪金要求是多少?",
      "refer_answer": "(这是必不可少的问题，因为你和你的考官出于不同考虑都十分关心它。)你聪明的做法是：不作正面回答。强调你最感兴趣的是这个机遇和挑战并存的工作，避免讨论经济上的报酬，直到你被雇用为止。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 14,
      "title": "你还有什么问题吗?",
      "refer_answer": "你必须回答“当然”。你要准备通过你的发问，了解更多关于这家公司、这次面试、这份工作的信息。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    }
  ],
  "count": 14,
  "questionsFileArry": [],
  "status": {
    "collection": false,
    "doing": false,
    "done": false
  }
},
{
  "parentId": 2,
  "industry": "销售",
  "class": "面试题",
  "title": "销售类工作的面试问题",
  "tips": "这是这个题库的总提示",
  "questions": [{
      "id": 1,
      "title": "谈谈你的缺点",
      "refer_answer": "1、不宜说自己没缺点。 \n　　2、不宜把那些明显的优点说成缺点。 \n　　3、不宜说出严重影响所应聘工作的缺点。 \n　　4、不宜说出令人不放心、不舒服的缺点。 \n　　5、可以说出一些对于所应聘工作“无关紧要”的缺点，甚至是一些表面上看是缺点，从工作的角度看却是优点的缺点。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 2,
      "title": "谈一谈你的一次失败经历",
      "refer_answer": "1、不宜说自己没有失败的经历。 \n　　2、不宜把那些明显的成功说成是失败。 \n　　3、不宜说出严重影响所应聘工作的失败经历。 \n　　4、所谈经历的结果应是失败的。 \n　　5、宜说明失败之前自己曾信心白倍、尽心尽力。 \n　　6、说明仅仅是由于外在客观原因导致失败。 \n　　7、失败后自己很快振作起来，以更加饱满的热情面对以后的工作。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 3,
      "title": "你为什么选择我们公司？",
      "refer_answer": "1、面试官试图从中了解你求职的动机、愿望以及对此项工作的态度。 \n　　2、建议从行业、企业和岗位这三个角度来回答。 \n　　3、参考答案——“我十分看好贵公司所在的行业，我认为贵公司十分重视人才，而且这项工作很适合我，相信自己一定能做好。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 4,
      "title": "如果我录用你，你将怎样开展工作？",
      "refer_answer": "1、如果应聘者对于应聘的职位缺乏足够的了解，最好不要直接说出自己开展工作的具体办法。 \n　　2、可以尝试采用迂回战术来回答，如“首先听取领导的指示和要求，然后就有关情况进行了解和熟悉，接下来制定一份近期的工作计划并报领导批准，最后根据计划开展工作。1、如果应聘者对于应聘的职位缺乏足够的了解，最好不要直接说出自己开展工作的具体办法。 \n　　2、可以尝试采用迂回战术来回答，如“首先听取领导的指示和要求，然后就有关情况进行了解和熟悉，接下来制定一份近期的工作计划并报领导批准，最后根据计划开展工作。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 5,
      "title": "与上级意见不一致时，你将怎么办？",
      "refer_answer": "1、一般可以这样回答“我会给上级以必要的解释和提醒，在这种情况下，我会服从上级的意见。” \n　　2、如果面试你的是总经理，而你所应聘的职位另有一位经理，且这位经理当时不在场，可以这样回答：“对于非原则性问题，我会服从上级的意见，对于涉及公司利益的重大问题，我希望能向更高层领导反映。”“应届毕业生缺乏经验，如何能胜任工作？",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 6,
      "title": "我们为什么要录用你？",
      "refer_answer": "1、应聘者最好站在招聘单位的角度来回答。 \n　　2、招聘单位一般会录用这样的应聘者：基本符合条件、对这份共组感兴趣、有足够的信心。 \n　　3、如“我符合贵公司的招聘条件，凭我目前掌握的技能、高度的责任感和良好的饿适应能力及学习能力，完全能胜任这份工作。我十分希望能为贵公司服务，如果贵公司给我这个机会，我一定能成为贵公司的栋梁！",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 7,
      "title": "你能为我们做什么？",
      "refer_answer": "1、基本原则上“投其所好”。 \n　　2、回答这个问题前应聘者最好能“先发制人”，了解招聘单位期待这个职位所能发挥的作用。 \n　　3、应聘者可以根据自己的了解，结合自己在专业领域的优势来回答这个问题。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 8,
      "title": "你是应届毕业生，缺乏经验，如何能胜任这项工作？",
      "refer_answer": "1、如果招聘单位对应届毕业生的应聘者提出这个问题，说明招聘单位并不真正在乎“经验”，关键看应聘者怎样回答。 \n　　2、对这个问题的回答最好要体现出应聘者的诚恳、机智、果敢及敬业。 \n　　3、如“作为应届毕业生，在工作经验方面的确会有所欠缺，因此在读书期间我一直利用各种机会在这个行业里做兼职。我也发现，实际工作远比书本知识丰富、复杂。但我有较强的责任心、适应能力和学习能力，而且比较勤奋，所以在兼职中均能圆满完成各项工作，从中获取的经验也令我受益非浅。请贵公司放心，学校所学及兼职的工作经验使我一定能胜任这个职位。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 9,
      "title": "你希望与什么样的上级共事？",
      "refer_answer": "1、通过应聘者对上级的“希望”可以判断出应聘者对自我要求的意识，这既上一个陷阱，又上一次机会。 \n　　2、最好回避对上级具体的希望，多谈对自己的要求。 \n　　3、如“做为刚步入社会新人，我应该多要求自己尽快熟悉环境、适应环境，而不应该对环境提出什么要求，只要能发挥我的专长就可以了。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 10,
      "title": "为什么你觉得自己可以胜任这份工作？",
      "refer_answer": "这种情况下所提到的资格是指能够让你胜任这份工作的所有资格，包括教育、工作经验或个性。大多数情况下，这个问题可以决定你是否能够获得这份工作。因此你必须作出清晰的回答，并给面试者留下深刻印象。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    }
  ],
  "count": 10,
  "questionsFileArry": [],
  "status": {
    "collection": false,
    "doing": false,
    "done": false
  }
},
{
  "parentId": 3,
  "industry": "银行",
  "class": "面试题",
  "title": "银行面试需注意的问题",
  "tips": "这是这个题库的总提示",
  "questions": [{
      "id": 1,
      "title": "请你自我介绍一下。",
      "refer_answer": "1、这是面试的必考题目。 \n　　2、介绍内容要与个人简历相一致。 \n　　3、表述方式上尽量口语化。 \n　　4、要切中要害，不谈无关、无用的内容。 \n　　5、条理要清晰，层次要分明。6、事先最好以文字的形式写好背熟。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 2,
      "title": "谈谈你的家庭情况。",
      "refer_answer": "1、况对于了解应聘者的性格、观念、心态等有一定的作用，这是招聘单位问该问题的主要原因。\n　　2、简单地罗列家庭人口。 \n　　3、宜强调温馨和睦的家庭氛围。 \n　　4、宜强调父母对自己教育的重视。 \n　　5、宜强调各位家庭成员的良好状况。 \n　　6、宜强调家庭成员对自己工作的支持。 \n　　7、宜强调自己对家庭的责任感。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 3,
      "title": "你有什么业余爱好？",
      "refer_answer": "1、业余爱好能在一定程度上反映应聘者的性格、观念、心态，这是招聘单位问该问题的主要原因。 \n　　2、最好不要说自己没有业余爱好。 \n　　3、不要说自己有那些庸俗的、令人感觉不好的爱好。 \n　　4、最好不要说自己仅限于读书、听音乐、上网，否则可能令面试官怀疑应聘者性格孤僻。 \n　　5、最好能有一些户外的业余爱好来“点缀”你的形象。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 4,
      "title": "你最崇拜谁？",
      "refer_answer": "1、最崇拜的人能在一定程度上反映应聘者的性格、观念、心态，这是面试官问该问题的主要原因。 \n　　2、不宜说自己谁都不崇拜。 \n　　3、不宜说崇拜自己。 \n　　4、不宜说崇拜一个虚幻的、或是不知名的人。 \n　　5、不宜说崇拜一个明显具有负面形象的人。 \n　　6、所崇拜的人人最好与自己所应聘的工作能“搭”上关系。 \n　　7、最好说出自己所崇拜的人的哪些品质、哪些思想感染着自己、鼓舞着自己。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 5,
      "title": "你的座右铭是什么？",
      "refer_answer": "1、座右铭能在一定程度上反映应聘者的性格、观念、心态，这是面试官问这个问题的主要原因。\n　　2、不宜说那些引起不好联想的座右铭。 \n　　3、不宜说那些太抽象的座右铭。 \n　　4、不宜说太长的座右铭。 \n　　5、座右铭最好能反映出自己某种优秀品质。 \n　　6、参考答案——“只为成功找方法，不为失败找借口",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 6,
      "title": "谈谈你的缺点。",
      "refer_answer": "1、不宜说自己没缺点。 \n　　2、不宜把那些明显的优点说成缺点。 \n　　3、不宜说出严重影响所应聘工作的缺点。 \n　　4、不宜说出令人不放心、不舒服的缺点。 \n　　5、可以说出一些对于所应聘工作“无关紧要”的缺点，甚至是一些表面上看是缺点，从工作的角度看却是优点的缺点。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 7,
      "title": "谈一谈你的一次失败经历。",
      "refer_answer": "1、不宜说自己没有失败的经历。 \n　　2、不宜把那些明显的成功说成是失败。 \n　　3、不宜说出严重影响所应聘工作的失败经历。 \n　　4、所谈经历的结果应是失败的。 \n　　5、宜说明失败之前自己曾信心白倍、尽心尽力。 \n　　6、说明仅仅是由于外在客观原因导致失败。 \n　　7、失败后自己很快振作起来，以更加饱满的热情面对以后的工作。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    }
  ],
  "count": 7,
  "questionsFileArry": [],
  "status": {
    "collection": false,
    "doing": false,
    "done": false
  }
},
{
  "parentId": 4,
  "industry": "通用",
  "class": "面试题",
  "title": "常见面试题及回答思路",
  "tips": "这是这个题库的总提示",
  "questions": [{
      "id": 1,
      "title": "请你自我介绍一下。",
      "refer_answer": "让求职者先介绍一下自己是面试的第一道题目。你需要注意的是自己介绍的内容要和简历上写的相一致，表述的时候尽量口语化，说与应聘岗位相关的内容。事先自己最好列出提纲，保证条理清晰，层次分明。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 2,
      "title": "谈谈你的家庭情况。",
      "refer_answer": "招聘单位问这个问题主要是想通过家庭情况来了解你的性格、观念和心态。你要做的就是简单地说一下家庭人口，强调温馨和睦的家庭氛围，父母对自己教育的重视，各位家庭成员对自己工作的支持，自己对家庭的责任感……\n",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 3,
      "title": "你有什么业余爱好?",
      "refer_answer": "面试的时候求职者经常会被问到这个问题，因为业余爱好能在一定程度上反映应聘者的性格、能力，所以就算你真的没什么特别钟爱做的事情也千万不要这么说。另外要避免说自己的一些庸俗的、令人感觉不好的爱好;不要说自己的爱好只有看书、听歌，这可能令面试官怀疑应聘者性格孤僻;最好能有一些户外运动类的爱好来“点缀”你的形象。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 4,
      "title": "谈谈你的缺点。",
      "refer_answer": "当面试官问到这个问题的时候，你最好不要说自己没有缺点，也不应该说出严重影响所应聘工作的缺点。你可以说出一些对于工作无关紧要的缺点，甚至是一些表面上看是缺点，从工作的角度看却是优点的特点，比如“爱幻想”、“想法多”一般被看做是为人不踏实的缺点，但是对于设计类的工作来说就是个优点。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 5,
      "title": "你为什么选择我们公司?",
      "refer_answer": "面试官试图从你的回答中了解你求职的动机、对工作的期望和态度。小编建议你从行业、企业和岗位三个角度来回答，例如“我认为这个行业潜力巨大，贵公司十分重视人才，而且这项工作很适合我，我相信自己的能力。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 6,
      "title": "你对加班的看法？",
      "refer_answer": "实际上好多公司问这个问题，并不证明一定要加班，只是想测试你是否愿意为公司奉献。\n　　回答样本：如果是工作需要我会义不容辞加班，我现在单身，没有任何家庭负担，可以全身心的投入工作。但同时，我也会提高工作效率，减少不必要的加班。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 7,
      "title": "你怎样看待学历和能力？",
      "refer_answer": "学历我想只要是大学专科的学历，就表明觉得我具备了根本的学习能力。剩下的，你是学士也好，还是博士也好，对于这一点的讨论，不是看你学了多少知识，而是看你在这个领域上发挥了什么，也就是所说的能力问题。一个人工作能力的高低直接决定其职场命运，而学历的高低只是进入一个企业的敲门砖，如果贵公司把学历卡在博士上，我就无法进入贵公司，当然这不一定只是我个人的损失，如果一个专科生都能完成的工作，您又何必非要招聘一位博士生呢？",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 8,
      "title": "喜欢这份工作的哪一点？",
      "refer_answer": "相信其实大家心中一定都有答案了吧！每个人的价值观不同，自然评断的标准也会不同，但是，在回答面试官这个问题时可不能太直接就把自己心理的话说出来，尤其是薪资方面的问题，不过一些无伤大雅的回答是不错的考虑，如交通方便，工作性质及内容颇能符合自己的兴趣等等都是不错的答案，不过如果这时自己能仔细思考出这份工作的与众不同之处，相信在面试上会大大加分。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 9,
      "title": "你是否可以接受加班？",
      "refer_answer": "我愿意接受挑战。在自己责任范围内的工作，不能算是加班。\n　　点评：这是面试者针对应聘者的工作热忱而提的问题，因无理的加班不一定是好的。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 10,
      "title": "谈谈你过去的工作经验中，最令你挫折的事情？",
      "refer_answer": "曾经接触过一个客户，原本就有耳闻他们以挑剔出名，所以事前的准备功夫做得十分充分，也投入了相当多的时间与精力，最后客户虽然并没有照单全收，但是接受的程度已经出乎我们意料之外了。原以为从此可以合作愉快，却得知客户最后因为预算关系选择了另一家代理商，之前的努力因而付诸流水。尽管如此，我还是从这次的经验学到很多，如对该产业的了解，整个团队的默契也更好了。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    }
  ],
  "count": 10,
  "questionsFileArry": [],
  "status": {
    "collection": false,
    "doing": false,
    "done": false
  }
},
{
  "parentId": 5,
  "industry": "销售",
  "class": "面试题",
  "title": "销售岗位的面试问题",
  "tips": "这是这个题库的总提示",
  "questions": [{
      "id": 1,
      "title": "你为什么想做销售工作？",
      "refer_answer": "a.有挑战性，我希望拿到高薪。不想做将军的士兵不是好士兵，不想拿高薪的销售员不是有拼劲的销售员。企业招聘销售员，就希望挑战高薪的人来，只有这样才能共同成长，互惠互利。\n   b.接触客户较多积累经验。\n   c.锻炼自己的各项能力。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 2,
      "title": "你认为自己最大的长处是什么？",
      "refer_answer": "这里你需要回答你如何与同伴合作，你是一个销售人员，需要有动力爆发力和前进的精神。这些都是这个工作所必不可少的基本技能。如果你有别的方面销售天赋，那只能说你就天生是用来做销售的面试销售经常会问到的问题以及面试技巧面试销售经常会问到的问题以及面试技巧。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 3,
      "title": "你认为自己最大的弱点是什么？",
      "refer_answer": "如果你想做销售，请不要说你的弱点是不善于交流或者人际关系。这些弱点都是销售的致命杀手。\n   在这种面试的情况下，请你不要说出自己有特别明显的缺点，或者说不要说出你应聘的职位最需要的缺点，可以谈一些不足，或者自己做不好的一些例子，但是不要因为谦虚，让招聘方认为你是一无是处的。这是最最重要的一点。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 4,
      "title": "为什么决定到我们公司应聘这份销售工作？",
      "refer_answer": "针对这个问题，用人单位都不希望求职者茫然地凝视和耸肩，然后含糊其词地说：“你们在报纸上打广告，我就来应聘了。\n  企业希望找到证据证实你对下列情况有些基本的了解：你所应聘的公司是做什么的？销售对象是哪些？为什么说把公司的产品或服务卖给那些人是一个对专业水平的挑战？在回答时，尽量表达出内心对于销售这份工作的热情。\n    通常做销售需要承受较大的压力，有强烈的工作的激情以及良好的够听能力，这些都是做为销售员所要经历或是面对的，这些素质也是求职单位希望看到的。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    }
  ],
  "count": 4,
  "questionsFileArry": [],
  "status": {
    "collection": false,
    "doing": false,
    "done": false
  }
},
{
  "parentId": 6,
  "industry": "护士",
  "class": "面试题",
  "title": "护士面试有哪些注意事项？",
  "tips": "这是这个题库的总提示",
  "questions": [{
      "id": 1,
      "title": "请进行一分钟左右的自我介绍。",
      "refer_answer": "尊敬的各位前辈您们好：\n　　今天能够站在这里参加面试，有机会向各位前辈请教和学习，我感到非常的荣幸。对这次机会也是倍加珍惜，希望通过这次面试能够把最好的自己展示给你们，也希望能给各位前辈留下一个好印象。\n　　下面做一下自我介绍：两年多的护士工作经验让我有了较熟练的实际操作能力。我的性格很随和，待人真诚，更坚守了我想用实际行动履行救死扶伤职责的信心，我现在最希望的就是各位领导能给我这个机会，让我有机会在该院的医护事业上添砖加瓦。最后祝贵院的医学事业蒸蒸日上，谢谢大家！",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 2,
      "title": "为什么会选择这个职业？",
      "refer_answer": "对于护士这份职业，我从小就很向往，因为小时候身体不好，在医院里好多护士姐姐都很亲切，我受到了很好的照顾，我更能理解与体会人在生病的时候，医护人员的爱心与耐心对于病人的重要性，更能领悟白医天使的深刻内涵与神圣，所以我一直梦想着做一名护士。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 3,
      "title": "作为一名医务工作者，你认为你有哪些优势和不足？",
      "refer_answer": "1、我有比较强的团体精神，能和同事建立起一种相互信任的合作关系，有良好的倾听能力和沟通能力，能和其他人互动，共享信息和荣誉，对待工作认真努力，能够及时完成，并且很乐意帮助同事，乐于承担本职工作以外的工作，而且在工作中这种精神得到了提高和完善。\n　　2、俗话说，人无完人，金无足赤，同样在我身上也存在着不足之处，诸如社会阅历浅，工作经验少等，只有通过自身不断地发现，再改正，并真诚、虚心地向别人请教学习，才能克服缺点，不断完善自已。\n",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 4,
      "title": "你为什么要选择中心医院？",
      "refer_answer": "第一、因为家庭原因，我想在本市工作；\n　　第二、中心医院不管是在硬件设施方面，还是在软件方面都是本市同类医院中的佼佼者；\n　　第三、据我了解，贵医院对员工的培训机制比较健全，这样能有助于提高我自身的专业技能总之，我是通过深思熟虑才来贵医院应聘的，既然我选择了中心医院，那么我一定会用最饱满的激情投入我的工作中。\n　",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 5,
      "title": "你怎么看待你以前就职的医院？有哪些地方不是很合理，你是怎么处理的？",
      "refer_answer": "一、在以往的过程中，我发现我所在的医院中，对残疾人提供的设施比较少；\n　　二、针对这一情况，我会和同事一起先作出调查，比如计算一周内进入医院的残疾人人数，请残疾人填写一些问卷调查等；\n　　三、调查结束后，我会详细地写一份调查报告交给医院，分析病人的满意程度和需要添加的设备，提出切实可行的方案供医院参考，希望这些情况能够得到医院的解决。\n",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 6,
      "title": "如果你在门诊，突然发现一个病人疑似H1N1，你该怎么处理？\n",
      "refer_answer": "一、首先要保持冷静的态度，不要惊慌，在医院遇到这样的病人很正常；\n　　二、以委婉的语气告诉病人他需要做别的检查，然后带他去另一间房间进行隔离；\n　　三、立刻将这一情况汇报上级，并且说明已经对病人进行隔离；\n　　四、口气委婉地告知这个病人，他可能患有HIN1，要确诊还要进行别的检查，希望他能够配合我们的工作，进行隔离，不要到处走动。\n",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 7,
      "title": "请问你对这个职务的期许？",
      "refer_answer": "希望能借此发挥我的所学及专长，同时也吸收贵公司在这方面的经验，就公司、我个人而言，缔造“双赢”的局面。\n　　分析：回答前不妨先询问该公司对这项职务的责任认定及归属，因为每一家公司的状况不尽相同，以免说了一堆理想抱负却发现牛头不对马嘴。\n",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 8,
      "title": "谈谈你过去做过的成功案例？",
      "refer_answer": "举一个你最有把握的例子，把来龙去脉说清楚，而不要说了很多却没有重点。切忌夸大其词，把别人的功劳到说成自己的，很多主管为了确保要用的人是最适合的，会打电话向你的前一个主管征询对你的看法及意见，所以如果说谎，是很容易穿帮的。\n",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 9,
      "title": "为了做好你工作份外之事，你该怎样获得他人的支持和帮助？",
      "refer_answer": "每个公司都在不断变化发展的过程中，你当然希望你的员工也是这样。你希望得到那些希望并欢迎变化的人，因为这些人明白，为了公司的发展，变化是公司日常生活中重要组成部分。这样的员工往往很容易适应公司的变化，并会对变化做出积极的响应。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    }
  ],
  "count": 9,
  "questionsFileArry": [],
  "status": {
    "collection": false,
    "doing": false,
    "done": false
  }
},
{
  "parentId": 7,
  "industry": "会计",
  "class": "笔试题",
  "title": "会计岗面试，你必须要知道的专业面试真题！",
  "tips": "这是这个题库的总提示",
  "questions": [{
      "id": 1,
      "title": "企业一般对现金管理有哪些要求？",
      "refer_answer": "根据国家现金管理制度和结算制度的规定，企业收支的各种款项必须按照国务院颁发的《现金管理暂行条例》的规定办理，在规定的范围内使用现金。\n   允许企业使用现金结算的范围有：\n    1.职工工资、津贴；\n   2.个人劳务报酬；\n   3.根据国家规定颁发给个人的科学技术、文化艺术、体育等各种奖金；\n   4.各种劳保、福利费用以及国家规定的对个人的其他支出；\n   5.向个人收购农副产品和其他物资的价款；\n    6.出差人员必须随身携带的差旅费；\n   7.零星支出；\n    8.中国人民银行确定需要支付现金的其他支出。\n   企业在经营活动中发生的现金收入，应及时送存银行，不得直接用于支付自己的支出。企业如因特殊情况需要坐支现金的，应当事先报经开户银行审查批准，由开户银行核定坐支范围和限额。\n   企业不得用不符合财务制度的凭证顶替库存现金，即不得“白条抵库”；不准谎报用途套取现金；不准用银行账户代其他单位和个人存入或支取现金；不准用单位收入的现金以个人名义存入储蓄；不准保留账外公款，即不得“公款私存”，不得设置“小金库”等。\n",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 2,
      "title": "现金的限额一般是多少？",
      "refer_answer": "库存现金的限额，由开户行根据开户单位的实际需要和距离银行远近等情况核定。其限额一般按照单位3—5天日常零星开支所需现金确定。远离银行机构或交通不便的单位可依据实际情况适当放宽，但最高不得超过15天。\n   库存现金限额的计算方式一般是：库存现金＝前一个月的平均每天支付的数额（不含每月平均工资数额）×限定天数\n",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 3,
      "title": "现金支票有何特点？限额是多少？填写要求？",
      "refer_answer": "现金支票的特点：现金支票只能用于支取现金，它可以由存款人签发用于到银行为本单位提取现金，也可以签发给其他单位和个人用来办理结算或者委托银行代为支付现金给收款人。\n   每个银行限额不一样，一般现金限额是5万元。\n   支票填写要求：\n   1.支票正面盖财务专用章和法人章(在填写金额一栏的下面)，缺一不可，印泥为红色，印章必须清晰，印章模糊只能将本张支票作废，换一张重新填写重新盖章。\n   2.出票日期数字必须大写。\n   3.现金支票收款人写本单位名称。\n   4.人民币（大写）：数字大写要正确。\n   5.人民币小写：最高金额的前一位空白格用“羊”字头打掉，数字填写要求完整清楚。\n   6.用途：一般填写“备用金”、“差旅费”、“工资”、“劳务费”等。\n   7.盖章：支票正面盖财务专用章和法人章，缺一不可，印泥为红色，印章必须清晰，印章模糊只能将本张支票作废，换一张重新填写重新盖章。\n",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 4,
      "title": "农民专业合作社与社员签订的合同，需要缴纳印花税吗？",
      "refer_answer": "根据《财政部　税务总局关于农民专业合作社有关税收政策的通知》的规定： 对农民专业合作社销售本社成员生产的农业产品，视同农业生产者销售自产农业产品免征增值税。\n   第三条规定：对农民专业合作社向本社成员销售的农膜、种子、种苗、农药、农机，免征增值税；第四条规定：对农民专业合作社与本社成员签订的农业产品和农业生产资料购销合同，免征印花税。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 5,
      "title": "企业所得税是按月预缴或者按季预缴的，对小型微利企业有哪些特别规定？",
      "refer_answer": "小型微利企业所得税统一实行按季预缴。按月度预缴企业所得税的企业，在当年度4月、7月、10月预缴申报时，如果按照国家税务总局公告2019年第2号判定符合小型微利企业条件的，下一个预缴申报期起调整为按季度预缴申报，一经调整，当年度内不再变更。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    }
  ],
  "count": 5,
  "questionsFileArry": [],
  "status": {
    "collection": false,
    "doing": false,
    "done": false
  }
},
{
  "parentId": 8,
  "industry": "教师",
  "class": "面试题",
  "title": "中小学英语教师面试（常见问题）",
  "tips": "这是这个题库的总提示",
  "questions": [{
      "id": 1,
      "title": "如何对待差生？如何发现“差生”身上的闪光点？",
      "refer_answer": "首先，应该公正，平等地对待差生，尊重他们的人格，听取他们的意见，从而对他们产生一种激励作用。对差生，要多几分尊重，多几分理解。\n其次，必须大力进行感情投资。理解学生，相信学生，学生感受到老师的爱。学生对老师有感情，才会听取老师的教诲。否则，老师的苦口婆心的教育只是徒劳。\n另外，挖掘“闪光点”，帮助后进生在学生心目中占有一席之地，为他们不断创造成功的机遇。想获得成功是人们普遍的心里愿望，帮助他们树立信心，在各项活动中，特别注意鼓励差生积极参与，发挥他们各自的爱好和专长，使他们获得自我成就感，为他们创造成功的条件的机遇。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 2,
      "title": "小学英语教学和中学英语教学的区别？",
      "refer_answer": "小学英语是培养、保持学生兴趣。内容简单，课堂形式丰富，娱乐成分多，知识融在活动中，强调口语淡化语法。\n中学学习紧、任务重，趣味性教学不多，主要是“培养学习英语兴趣”朝着培养“初步学习英语的信心”转化。会集中在某个单词上，让学生从感性认识到理性认识，以及怎样把学到的单词用到句中去，完成从单词--句子--写作的提升。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 3,
      "title": "为什么学生会偏科？学生偏科怎么办？",
      "refer_answer": "学生偏科有很多因素，一方面是对这门课程的兴趣和态度。学生无论学哪一门学科，都可能由于种种原因出现一些知识漏洞，，如果家长和老师也没太注意，学生的漏洞就可能扩大，大到一定程度，就听不懂新课了，这种情况理科和外语最明显。学生越听不懂越不爱学，不爱学就更跟不上。在情感上厌恶和躲避这门课，于是偏科了。先“侦察”，找到孩子漏洞所在，再补漏。\n另一方面如果教师对学生抱有成见，或者学生对教师抱有成见，师生关系紧张甚至对立，学生这科的成绩就可能迅速下降。找到突破点，调整和改善师生关系，让学生喜欢老师，老师喜欢学生，这些问题将会迎刃而解。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 4,
      "title": "怎样与学生进行良好的沟通？",
      "refer_answer": "首先如果要进行良好的沟通就要积极主动地了解学生的学习生活情况，表现出真诚的关心，能够设身处地的为学生着想，感受学生的内心世界。如果学生感受到了教师的爱，信任教师，则肯定会乐于与教师进行沟通。\n其次对于不同的学生采取不同的沟通方式，对于调皮的学生就要经常谈话，督促他改进缺点。对于不善言谈和性格孤僻的学生，还可以进行书信和谈话相结合的方式，想方设法走进学生的心灵。语言要幽默，委婉，含蓄。\n另外良好的沟通，需要耐心的聆听对方，了解他心中的感受。教师对学生积极聆听的态度，可以使学生觉得受到重视并肯定自己的价值。要避免当学生讲话时，急于表达自己的观点。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 5,
      "title": "怎样提高学生学习英语的兴趣？",
      "refer_answer": "英语的学习，主要是教师创设英语情景，培养听说能力。从心理学的角度来说，儿童富有好奇心，听觉灵敏，善于模仿，心理障碍较少，他们对一种新语言的学习往往产生强烈浓厚的兴趣，趣是最好的老师。孔子也曾说：“知之者不如好之者，好之者不如乐之者。”这里的“乐”指的正是“兴趣”。因此，教师在教学过程中要精心设计教案，想方设法以新颖、丰富多彩的教学手段激发学生兴趣，用兴趣来激活他们的思维，唤起他们的学习注意，在小学英语课堂教学中，有一些些教学手段是行之有效的;　一个生动有趣的故事，一首优美动听的歌曲。一个可爱的顺口溜　，一段活泼有趣的动画片都是可以提高孩子学习英语的兴趣的。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 6,
      "title": "怎样提高小学生学习英语的兴趣？",
      "refer_answer": "首先，英语对于小学生来说是个新的学科，不像语文和数学孩子平时有些接触，所以学起来没有抵触感。因此，一定要结合小学生的心理特点，根据小学生喜欢有趣的事物的特征，将英语教学变的丰富多彩，有趣一些，寓教于乐，让孩子在笑声中学到知识。\n其次，英语对于孩子来讲是一种新的语言，家长或者老师可以通过和孩子简单的英语沟通让孩子觉得英语并不是那么的陌生，同时也能给孩子形成一种学习英语的氛围，让孩子潜移默化中学到英语。这样就能增加孩子学习英语的乐趣。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    }
  ],
  "count": 6,
  "questionsFileArry": [],
  "status": {
    "collection": false,
    "doing": false,
    "done": false
  }
},
{
  "parentId": 9,
  "industry": "会计",
  "class": "面试题",
  "title": "最常见的财务专业面试真题",
  "tips": "这是这个题库的总提示",
  "questions": [{
      "id": 1,
      "title": "企业一般对现金管理有哪些要求？",
      "refer_answer": "根据国家现金管理制度和结算制度的规定，企业收支的各种款项必须按照国务院颁发的《现金管理暂行条例》的规定办理，在规定的范围内使用现金。允许企业使用现金结算的范围有：\n职工工资、津贴；个人劳务报酬；根据国家规定颁发给个人的科学技术、文化艺术、体育等各种奖金；各种劳保、福利费用以及国家规定的对个人的其他支出；向个人收购农副产品和其他物资的价款；出差人员必须随身携带的差旅费；零星支出；中国人民银行确定需要支付现金的其他支出。\n企业在经营活动中发生的现金收入，应及时送存银行，不得直接用于支付自己的支出。企业如因特殊情况需要坐支现金的，应当事先报经开户银行审查批准，由开户银行核定坐支范围和限额。企业不得用不符合财务制度的凭证顶替库存现金，即不得“白条抵库”；不准谎报用途套取现金；不准用银行账户代其他单位和个人存入或支取现金；不准用单位收入的现金以个人名义存入储蓄；不准保留账外公款，即不得“公款私存”，不得设置“小金库”等。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 2,
      "title": "现金的限额一般是多少？",
      "refer_answer": "库存现金的限额：由开户行根据开户单位的实际需要和距离银行远近等情况核定。其限额一般按照单位3—5天日常零星开支所需现金确定。远离银行机构或交通不便的单位可依据实际情况适当放宽，但最高不得超过15天。\n库存现金限额的计算方式一般是：库存现金＝前一个月的平均每天支付的数额（不含每月平均工资数额）×限定天数",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 3,
      "title": "现金支票有何特点？限额是多少？填写要求？",
      "refer_answer": "现金支票的特点：现金支票只能用于支取现金，它可以由存款人签发用于到银行为本单位提取现金，也可以签发给其他单位和个人用来办理结算或者委托银行代为支付现金给收款人。\n每个银行限额不一样，一般现金限额是5万元。\n支票填写要求：\n（1）支票正面盖财务专用章和法人章(在填写金额一栏的下面)，缺一不可，印泥为红色，印章必须清晰，印章模糊只能将本张支票作废，换一张重新填写重新盖章。\n（2）出票日期数字必须大写。\n（3）现金支票收款人写本单位名称。\n（4）人民币（大写）：数字大写要正确。\n（5）人民币小写：最高金额的前一位空白格用“羊”字头打掉，数字填写要求完整清楚。\n（6）用途：一般填写“备用金”、“差旅费”、“工资”、“劳务费”等。\n（7）盖章：支票正面盖财务专用章和法人章，缺一不可，印泥为红色，印章必须清晰，印章模糊只能将本张支票作废，换一张重新填写重新盖章。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 4,
      "title": "农民专业合作社与社员签订的合同，需要缴纳印花税吗？",
      "refer_answer": "根据《财政部　税务总局关于农民专业合作社有关税收政策的通知》的规定： 对农民专业合作社销售本社成员生产的农业产品，视同农业生产者销售自产农业产品免征增值税。\n第三条规定：对农民专业合作社向本社成员销售的农膜、种子、种苗、农药、农机，免征增值税；第四条规定：对农民专业合作社与本社成员签订的农业产品和农业生产资料购销合同，免征印花税。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 5,
      "title": "企业怎样来保管支票？有哪些要求？",
      "refer_answer": "（1）支票由出纳员负责购买、保管，支票密码要与支票分开存放。印鉴章由会计保管，实行严格分工和把关制度。\n（2）领用支票要填写“支票领用申请表”，报主管领导批准后，经会计审核后由出纳员负责签发，出纳员要在支票上写清日期、用途、密码及规定限额。会计负责加盖印鉴，严禁签发空白支票。\n（3）领用支票要填写“支票领用登记簿”。\n（4）严禁签发空头支票，不准将支票借给任何单位或个人办理结算。\n（5）外单位交来的支票，出纳员应及时送交银行，不得挪用、转让。\n（6）对每一张银行对账单，都要由出纳员编制“银行存款余额调节表”对未达账项要及时查询处理。\n（7）对作废支票，必须加盖作废戳记，并与存根一起保存，年终时装订成册，与票据一并保存。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 6,
      "title": "固定资产折旧采用的方法有哪些？",
      "refer_answer": "分为两类：直线法和加速折旧法\n其中直线法包括：平均年限法和工作量法\n加速折旧法包括：双倍余额递减法和年数总和法",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 7,
      "title": "最新小规模纳税人都需要交什么税？税率是多少？",
      "refer_answer": "小规模纳税人与一般纳税人的划分是增值税纳税人的分类，因此主要交的是增值税，按照3%的征收率征收。另外，地税还要交城建税、教育费附加和个人所得税等。对月销售低于3万元的小微企业，暂免征收增值税。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 8,
      "title": "财务报表分为哪几个？",
      "refer_answer": "（1）资产负债表、损益表、现金流量表或财务状况变动表、附表和附注；\n（2）附表通常包括：利润分配表、资产减值明细表、所有者权益、应交增值税明细表、分部报表。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 9,
      "title": "企业邀请安监专家给企业职工讲安全知识，安监人员的路费住宿费怎么处理？",
      "refer_answer": "非本公司人员发生的、与生产经营相关的差旅费、业务费，属于企业为组织和管理企业生产经营所发生的费用，可以记入“管理费用（业务招待费）”科目，根据企业所得税法的规定，企业实际发生的与取得收入有关的、合理的支出，包括成本、费用、税金、损失和其他支出，准予在计算应纳税所得额时扣除。\n有关的支出指与取得收入直接相关的支出。合理的支出指符合生产经营活动常规，应当计入当期损益或者有关资产成本的必要和正常的支出。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 10,
      "title": "对于成本控制你怎么看待？",
      "refer_answer": "对于专业从事内控管理（内部审计）工作的人员来说，掌握各个层次的成本控制方法，就可以比较透彻地了解企业运营管理中的潜在风险，对于提高内部审计效率也将有重大帮助。也有助于向管理者提供更多有增值作用的管理建议。\n从广义的角度来看，成本控制是企业内部控制的重要组成部分。但是，对于专业从事内控管理或内部审计的人员来说，充分掌握和透彻了解企业成本控制问题是做好内控服务的重要条件。成本控制在企业运营中的重要性无须讨论，可以毫不夸张地说，现代企业管理管的就是成本。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    }
  ],
  "count": 10,
  "questionsFileArry": [],
  "status": {
    "collection": false,
    "doing": false,
    "done": false
  }
},
{
  "parentId": 10,
  "industry": "高管",
  "class": "面试题",
  "title": "高管招聘：常见问题分析",
  "tip": "这是这个题库的总提示",
  "questions": [{
      "id": 1,
      "title": "高管招聘是否成功受很多因素影响，仅仅从面试的方面来看，常见的问题如下：",
      "refer_answer": "一、缺少标准：每个人心中都有标准。但是董事长有董事长的标准，总经理有总经理的标准，部门有部门的标准，人力资源部有人力资源部的标准，这些标准通常都不一致。管理层也没有一起坐下来探讨自己“企业”作为一个“组织”的优秀中高层标准是什么。企业选拔管理者特别是中高层管理者的标准是什么？“德才兼备”是一个常见的答案。但是追问一句：什么是德？回答不上来。这种情况非常多见，要么是没有明确的标准，要么标准都是一些抽象的语句，无法实际操作，不能用来甄别应聘者。\n二、不尊重应聘人员： \n在民营企业中这个问题很常见，有些企业的管理层和招聘人员的素质不高。很多应聘人员都有这种经历，面试官居高临下，语气强硬，好像别人都在求他。国内一家着名网络搜索公司招聘管理人员，公司前台对应聘者态度傲慢，对人爱理不理，通常要让他们在门外等待半小时后才开始面试。面试过程中考官极不耐烦，应聘者一句话没有讲完就被粗暴地打断，很多应聘者发誓再也不进入这家公司工作。 不知这些企业有没有认识到，对于真正有本领的人才来讲，现在是“卖方市场”而非“买方市场”，如果企业不尊重应聘者，那就很难招到合适的人才。\n三、要求过高： \n南方某着名电脑制造商招聘人力资源总监的条件是：10年以上工作经验；名牌大学人力资源管理相关专业毕业；5年以上着名企业人力资源总监工作经验；有思想家的深度、实干家的执行力、演说家的口才等等。但是给的薪水却不高。符合这种条件的人恐怕全国没有几个人，而且有这样的人，也不一定对你的公司感兴趣。 曾经有一家公司招聘总裁办主任，用了各种方式，但是招了一年也没有招到，老板很不高兴。大家会感到很纳闷，但是职位说明书对比，你会吓了一跳，原来这个总裁办职能强大，不但要做战略、计划及预算管理，还要负责分公司的绩效考核，内部审计、法律事务、流程优化、外部公关等等。这样的要求太高，市场上基本无人能胜任，做内部管理和做公共关系对人的要求差别很大，让一个人来负责，很难搞好。\n四、轻易相信应聘人员: \n尽管人们在日常生活中疑心重重，但是在招聘过程中，却会不假思索地相信应聘人员在面试中的回答及简历中的信息，不进行仔细的甄别，或者说没有能力和技术进行甄别。\n其实许多人在应聘职位时，根本就没有长期服务的想法，或者是为了摆脱目前的困境，或者找一家使自己看起来更有面子的公司，以备今后跳槽有资本。出于各种各样的动机，在面试中他们会调整“真相”迎合面试官。一个银行的信贷部门经理想应聘一家高科技公司的职位，当面试官问他是否有风险的承受能力时，他说自己非常喜欢给那些创业期的小型高科技企业贷款。实际上，他在过去的两年中只给两家类似企业贷过款。\n五、党同伐异：结构化面试是指在面试之前，确定好职位要求的能力清单和面试问题，然后在面试中严格根据问题来提问，判断候选人是否符合职位要求。许多面试官在面试过程中会高度评价那些与自己在某方面类似的人，例如同一个学校毕业的人、老乡、家庭背景相同等等，一个北京大学毕业的人做了某个部门的领导，他在招聘员工时总是倾向于招聘北大毕业的人。殊不知，这个职位可能更适合于那些观点或背景与他不同的人。相当数量的面试官，在面试过程中是以自己为标杆来衡量应聘者的。一般来说，越是经验丰富、比较成功的人，越是喜欢以己为标准。这样的结果便是把个人的好恶、价值观以及各方面的能力作为录取的标准。以自己为标准的做法是企业招聘工作不规范的表现。即使有的企业招聘要求非常清晰，也做过多方面的培训，但面试官在招聘中仍然不能按公司的要求行事。根本原因在于面试官是根据自己的理解来运用招聘标准的，如果标准不明确不具体，面试人员更容易以己为标准进行判断。\n六、不当授权：\n大多数管理人员都愿意自己参与招聘过程，但是很多主管人员出于种种原因，把招聘中关键的几步委托给别人完成。典型问题之一是他们要求直接下属或者人力资源部的员工草拟招聘职位的职位说明书，自己却很少参与。另一种错误是，主管人员指派的第一轮面试官要么对面试准备不足、要么动机不端正。更要命的是，有的公司还要小组负责初步面试，这对未来的销售总监来说似乎是奇耻大辱，未来的下属对自己评头论足!\n七、缺乏科学的办法和流程：\n中国企业目前的高管招聘面试一般是这样的：闲谈式对话，从面试官和候选人都熟悉的人到最近的体育比赛、国内外大事都可以成为谈论的话题。当谈到正题时，面试官会不紧不慢地提出几个早在候选人意料之中的问题，候选人不紧不慢地回答。这种面试没有结构，没有既定的流程，也没有既定的考察要素和问题，与其说是面试，不如说是聊天，双方可能会尽兴而归，但面试官对候选人的能力仍然不了解。\n八、忽略情商、深层能力和素质：\n大多数企业在招聘高管时，通常关注一些硬指标（表面指标）——教育背景、家庭背景、年龄、智商、过去工作经历、外表等，很少关注软指标（深层指标），如情商、性格、动机、分析思维能力等。但是，近来研究表明，情商、动机、抽象思维能力等是预测一个人能否胜任某个职位的关键要素。按照着名心理学家丹尼尔·戈尔曼的研究，如果想要取得优秀的工作业绩，情商的重要性是智商和技术能力的两倍。美国着名心理学家麦克利兰教授早在上个世纪70年代就指出，对业绩的最好预测因素不是大学学历等外在条件，而是人的深层素质，如动机等。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 2,
      "title": "中高层管理人员面试的一些技巧：",
      "refer_answer": "一、董事会、管理人员需要有开放、包容的心态：\n许多企业为什么找来了优秀的管理人才后，短时间马上就流失了呢？原因之一就是企业里面的管理层对外面新来人员的做法容易反感，不认可。很多管理人员思想守旧封闭，认为新来人员是对自己地位的威胁，处处制肘新来的空降兵，使得空降兵难以开展工作。而企业的最高层又没有对老人们进行教育、约束。这就要求最高领导人对老员工和管理人员进行充分的思想教育，使得老员工明白，企业招空降兵的目的不是要区威胁原有管理人员的地位，当然，有的时候，新旧冲突部分原因在于空降兵们的沟通和政治技巧不强，对企业的优良传统重视不够，想一切推倒重来。\n二、充分尊重，敢于授权：\n许多中高级管理人才之所以跳槽，无非是想到新企业施展拳脚，有一番作为。但是许多企业招来了空降兵后，又不敢大胆使用，不敢充分授权，使得空降兵的拳脚难以施展开，这是空降兵迅速流失的一个重要原因。笔者先前所在的一家知名的上市公司这方面就做得非常好。总经理和几个副总都是从著名外企招聘过来的，他们中大多数都在企业已经干了6、7年，带领企业从几千万迅速做到几个亿，可以说非常成功。主要原因就是老板非常信任他们，对他们充分授权，业务基本上不干涉他们。只要是高层管理人员职权范围内的事情，基本上由他们自己决定，不想许多民营企业家那样，虽然聘请了空降兵，但是由对他们职责范围内的工作指手画脚，任意干涉。\n三、对原有的薪酬体系进行调整，充分市场化：\n许多企业在招聘空降兵时，实行的是谈判工资制，远远高于企业内相类似岗位的人。这样企业的薪酬体系就被打乱，企业内部平衡也就被打破。直接导致了原有内部管理人员和新来空降兵的矛盾，导致原有老人的心理极不平衡，对原有老员工的积极性是一种极大的杀伤。这样，“招来一个空降兵，打击一批老员工”，企业往往得不偿失。\n四、战略目标清晰：\n为什么说，企业招聘空降兵前，要战略目标清楚呢？主要是讲企业不能依靠新来的“空降兵”制定公司的战略，确定公司的发展方向。一般来说，要想制定一个科学而又切实可行的企业战略，需要对企业的经营管理现状和企业文化做全面而深入的了解，一个新来的“空降兵”没有半年的时间是很难对企业做这样透彻的了解的，依靠他们制定战略的风险很大。而且，从外面招聘的空降兵（尤其是外企）一般不具备战略管理能力。联想前些年就从著名外企招了一些中高层，希望他们帮助制定科学的战略，但是后来发现他们普遍缺乏这方面的实践经验和训练。所以，企业在招聘空降兵之前最好有了清晰的战略目标，然后招“空降兵”们过来，实现这些目标，在执行战略的过程中不断锻炼他们的战略管理能力，然后再慢慢过渡到让他们帮助制定企业的战略规划。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    }
  ],
  "count": 2,
  "questionsFileArry": [],
  "status": {
    "collection": false,
    "doing": false,
    "done": false
  }
},
{
  "parentId": 11,
  "industry": "销售面试",
  "class": "面试题",
  "title": "销售面试：经典问题大全",
  "tip": "这是这个题库的总提示",
  "questions": [{
      "id": 1,
      "title": "你为什么会做销售工作?",
      "refer_answer": "这个问题对于工业专业出身的人来说有些不好回答，但是更重要的是你的实习经验，公司其实也没有必要回到学校请MBA来做这个职位。尽量让你的回答具体，最好用举例子的方法列举你以前的成功经验。而且让招聘方认为你具有做好这个工作的潜质。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 2,
      "title": "你认为自己最大的长处是什么?",
      "refer_answer": "这里你需要回答你如何与同伴合作，你是一个销售人员，需要有动力爆发力和前进的精神。这些都是这个工作所必不可少的基本技能。如果你有别的方面销售天赋，那只能说你就天生是用来做销售的。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 3,
      "title": "你认为自己最大的弱点是什么?",
      "refer_answer": "在这种面试的情况下，请你不要说出自己有特别明显的缺点，或者说不要说出你应聘的职位最需要的缺点，可以谈一些不足，或者自己做不好的一些例子，但是不要因为谦虚，让招聘方认为你是一无是处的。这是最最重要的一点。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 4,
      "title": "如何评价你自己?",
      "refer_answer": "这个问题是招聘方考察你的个人表达能力和认识能力的问题。你可以突出自己的一些优点，但是不要说得过于直白，同时要强调自己的能力比较适合做销售工作，这里技巧很重要。同时说话要机智，也可以适当加些小幽默，显示你天生有与人交际的能力，这对于销售工作来说是很重要的。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 5,
      "title": "工资对你有多重要?",
      "refer_answer": "不要说得很重要，因为如果做到一定的份额，工资自然会很高，但是也不要完全不在乎，因为销售是做生意，一定程度上有钱的意识也是必要的。可以先问一下公司可以提供的，自己只要看能否接受就可以，或者说适量就可以。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 6,
      "title": "请你现场 讲一个好笑的笑话?",
      "refer_answer": "这是一个看似很简单的问题，但是你会发现关键时刻能讲一个好笑的笑话也是一件很难的事情。这个问题，其实也是在考察你与人交际的能力。良好的客户意识和满足客户需要的能力，是这个问题的回答要点。讲不合时宜的冷笑话和又不好色彩的笑话是这个问题的大忌，不管它们有多好笑，都会使他们对你的品行产生不好的影响。所以千万要小心的讲看似轻松的笑话。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 7,
      "title": "为什么你对销售工作比其他职位更有兴趣?",
      "refer_answer": "这个问题需要从两方面回答。一个是从销售本身来说，你认为它有什么优势或者令你着迷的地方，你会全心全意的投入这个工作，但是切忌不能说别的职位就不好，这会让招聘方心情步愉快，而且你有可能会被调配，所以谓了不丧失工作机会，要三思而后言。另一个方面就是你个人的特点，因为个人能力和兴趣，更适合销售工作，这样会给招聘方留下相当良好的印象，收到事半功倍的效果。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 8,
      "title": "如果每天让你给客户突然打销售电话你会怎么办?",
      "refer_answer": "没有人愿意每天给客户突然打销售电话，因为这样收到冷遇的情况很多。但是不要直接说你不会干这项工作，你可以说你会考虑方法，或者说话的口气。或者你要是够机智的话，你可以提出不打突然电话，但是能达到一样效果的措施的话，那招聘方一定会对你刮目相看。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 9,
      "title": "你最大的一次冒险是什么，你是如何做的?",
      "refer_answer": "销售工作有时候是需要冒险精神的，但是不要给招聘方，你天生就是个冒险家，毕竟，做生意是要赚钱，不是冒险，如果招聘方认为你会拿公司的钱、信誉去冒险，那你可以说彻底没有希望了。但是销售是需要进取的职业，表现的萎缩不前，公司也不会考虑雇佣你。可以说一些野外的冒险故事，尽量逼真，说明你是勇敢的人，但不是表现在工作上的冒进。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 10,
      "title": "您在选择工作中更看重的是什么?",
      "refer_answer": "可能是成长空间、培训机会、发挥平台、薪酬等。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 11,
      "title": "您觉得您在以前类似于我司提供的这个岗位上的工作经历中有哪些方面做得不足?",
      "refer_answer": "分析问题：若答：有。会继续问：您打算在以后的工作中采取哪些改善措施?待回答完毕后。会继续发问：您再想想如果到我们公司来任职还有没有补充改善措施?若答：无。会继续发问：您好像不太连续去追求卓越，您认为您能胜任我们提供给您的这份工作吗?",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 12,
      "title": "是什么原因吸引你加入我们公司的?",
      "refer_answer": "要了解这家你面试的公司，了解公司的强项和不足，然后具体说一下你的设想，说明你到职后怎么样开展销售工作，要认同企业文化，特别是对于外资企业，企业文化是十分重要的，在同一个企业文化氛围中，才能有良好的团队合作意识，最好强调是企业文化比较吸引你。这样效果会比较好，但是如果你不是从内心认同，最好不要发表评论，言不由衷比什么都不说显得更加没有诚意，最好不要做这样的事情。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 13,
      "title": "请你和我谈一下经济?",
      "refer_answer": "其实是一个比较空泛的问题，但是最好提前准备一下，不要表现的对这方面一无所知。显得你根本没有诚意。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 14,
      "title": "如果你有一百万你会做什么?",
      "refer_answer": "一个考察你的计划性的问题，不能回答买房购车这样的事情，有头脑的人，永远将投资作为最大的快乐，显示你是个有计划的人，。但是不要浮夸，比如马上开一家公司这样的话，最好不要说，因为你一无所知的时候，如此激进会让招聘方对你产生不信任感。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 15,
      "title": "请和我谈一下你个人对股票的看法?",
      "refer_answer": "如果你不清楚，千万要诚恳，谈谈你个人的一些看法就好了，在专家面前班门弄斧可不是明智的选择。如果你提前有查阅相关资料，有这方面的准备，那么恭喜你，一个英明的决定。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 16,
      "title": "告诉我三种你想要买的股票?",
      "refer_answer": "只能靠你平时留心了，如果你不了解股票行业并且不感兴趣的话。但是不要瞎说，这样的会造成适得其反的效果。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 17,
      "title": "请讲讲你遇到的最困难的销售经历，你是怎样劝说客户购买你的产品的?",
      "refer_answer": "问题解析：不管销售也好还是其他的什么职业。当你去面试时最常见的就是这样的一个问题，让你说说自己曾经的工作经历，考官主要是想从你过去的工作中了解你处理问题的能力，回答这样的问题可以将过去的经历稍微夸大，让考官对你刮目相看。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 18,
      "title": "人们购买产品的主要原因都有什么?",
      "refer_answer": "大部分购买行为的发生，并不仅仅只是因为产品的价格或者是产品的质量，每一个人购买某种产品的目的都是满足他背后的某种需求。购买产品的人首先是想获得产品的使用价值满足自身的要求、产品的质量、价格也是促使人们是否购买产品的原因。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 19,
      "title": "关于我们的产品生产线和我们的客户群体，你了解多少?",
      "refer_answer": "问题解析：此类问题也是考管在面试时比较关注的，所以在准备面试前，你最好先对你打算进入的公司有一个整体的了解，做到有备而来。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 20,
      "title": "关于销售，你最喜欢和最不喜欢的是什么?为什么?",
      "refer_answer": "这个问题是考察你对销售工作的价值取向，你可以回答最喜欢得到签单后的那种快感，不喜欢被客户拒绝等等。销售工作有很多内容，这个工作主要是和人打交道的，所以你要接触很多人，有你喜欢的也有你不喜欢的。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    },
    {
      "id": 21,
      "title": "你最典型的一个工作日是怎样安排的?",
      "refer_answer": "在职场中我们给出了一个销售一天的工作安排，可以做为参考，回答这个问题前你应当已经有所准备，好的销售人员一天的工作应该是有序的。",
      "note": "这是一条备注",
      "analyse": "",
      "comments": []
    }
  ],
  "count": 21,
  "questionsFileArry": [],
  "status": {
    "collection": false,
    "doing": false,
    "done": false
  }
}
]